sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
/************************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      AVR32Sim.c
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2020
    *********************************************************************
    18.11.2009 Add _AT32UC3B support                                     {1}
    21.11.2009 Modification in the way that oscillator pin mapping is controlled - and extend to support all clock sources {2}
    26.01.2010 Add USBB                                                  {3}
    19.10.2010 Correct Timer 2 clock source                              {4}
    04.05.2011 Correct ADC block                                         {5}
    19.06.2011 Add _AT32UC3C support                                     {6}
    17.09.2011 Add SET_INPUT and CLEAR_INPUT port simulation support     {7}
    17.09.2011 Add external interrupt controller simulation support for _AT32UC3C {8}
    08.01.2012 Set power on reset cause                                  {9}
    19.07.2012 Corrected key scan support and enable non-matrix keypad   {10}
    19.07.2012 Add RTC                                                   {11}
    30.11.2012 Remove ODMER_x use when UC3C enabled                      {12}
    07.12.2012 Disable PHY interrupt when PHY_INTERRUPT is not defined   {13}
    05.01.2013 Correctly recognise UC3C watchdog retrigger               {14}

*/  


/* =================================================================== */
/*                           include files                             */
/* =================================================================== */
#include "config.h"

#if defined _HW_AVR32


/**************************************************************************************************/
/********************************* ATMEL AT32UC3A *************************************************/
/**************************************************************************************************/

static unsigned long port0_in;
static unsigned long port1_in;
static unsigned long port2_in;
static unsigned long port3_in;
static unsigned char ucPortFunctions[PORTS_AVAILABLE][PORT_WIDTH] = { 0 };
static unsigned long ulOscillator = 0;
#ifdef SUPPORT_ADC
    static unsigned long ulADC_values[ADC_CHANNELS];
    static void *ptrPorts[3] = {(void *)ucPortFunctions, (void *)ulADC_values, (void *)(ADC_BLOCK + 0x4)}; // {5}
#endif

static unsigned long ulTIOA = 0;

static int iFlagRefresh = 0;
static unsigned short usIdleCounter0;
static unsigned short usIdleCounter1;
static unsigned short usIdleCounter2;
static unsigned short usIdleCounter3;
#if NUMBER_SERIAL > 4
    static unsigned short usIdleCounter4;
#endif

#ifdef USB_INTERFACE
    static unsigned long ulEndpointInt = 0;    
    static int iRxDataBank[NUMBER_OF_USB_ENDPOINTS] = {0};
    static unsigned long ulTxDataBank[NUMBER_OF_USB_ENDPOINTS] = {0};
    static int iTxDataToggle[NUMBER_OF_USB_ENDPOINTS] = {0};
#endif

#define ASSERT_RTS_0    0x01
#define NEGATE_RTS_0    0x02
#define ASSERT_RTS_1    0x04
#define NEGATE_RTS_1    0x08
#define ASSERT_RTS_2    0x10
#define NEGATE_RTS_2    0x20
#define ASSERT_RTS_3    0x40
#define NEGATE_RTS_3    0x80


unsigned char ucFLASH[(SIZE_OF_FLASH*2) + USER_PAGE_SIZE];               // the flash size contains user page and space between
                                                                         // the space between the flash data array and user page is however not to be used


void fnDeleteFlashSector(unsigned char *ptrSector)
{
	int i = FLASH_GRANULARITY;

	while (i--) {
		*ptrSector++ = 0xff;
	}
}

// Enable simulation of direct FLASH access
//
extern unsigned char *fnGetFlashAdd(unsigned char *ucAdd)
{
    unsigned char *ucSimulatedFlash = ucAdd + (unsigned long)ucFLASH - (unsigned long)FLASH_START_ADDRESS;
    if ((ucSimulatedFlash < &ucFLASH[0]) || (ucSimulatedFlash >= &ucFLASH[SIZE_OF_FLASH])) { // check flash bounds
        _EXCEPTION("Attempted access outside of internal Flash bounds!!!");
    }
    return (ucSimulatedFlash);                                           // location in simulated internal FLASH memory
}

extern unsigned char *fnPutFlashAdd(unsigned char *ucAdd)
{
    unsigned long sim_add = (unsigned long)ucFLASH - (unsigned long)FLASH_START_ADDRESS;
    return ucAdd - sim_add;
}

extern unsigned char *fnGetEEPROM(unsigned short usOffset);

extern unsigned char *fnGetFileSystemStart(int iMemory)
{
#if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    return (fnGetEEPROM(uFILE_START));
#elif defined (SAVE_COMPLETE_FLASH)
    return (&ucFLASH[0]);
#else
    return (&ucFLASH[uFILE_START-FLASH_START_ADDRESS]);
#endif
}

extern unsigned long fnGetFlashSize(int iMemory)
{
#if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    return (fnGetEEPROMSize());
#elif defined (SAVE_COMPLETE_FLASH)
    return (sizeof(ucFLASH));
#else
    return (FILE_SYSTEM_SIZE);
#endif
}





// Process simulated Peripheral DMA
//
extern unsigned long fnSimDMA(char *argv[])
{
    static int iRTS_action = 0;
    unsigned long ulNewActions = 0;
#if defined SERIAL_INTERFACE && !defined _AT32UC3C
    int *ptrCnt;

    if (iDMA & DMA_CONTROLLER_0) {                                       // USART 0 Tx DMA
        if (DMA_CR_0 & DMA_TEN) {                                        // peripheral DMA transfer enabled
            ptrCnt = (int *)argv[THROUGHPUT_UART0];
            while (DMA_TCR_0 != 0) {
                if (*ptrCnt == 0) {
                    iMasks |= DMA_CONTROLLER_0;                          // no futher transmissions in this interval
                    break;
                }
                if ((US_MR_0 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= NEGATE_RTS_0;
                }
                US_THR_0 = *(unsigned char *)DMA_MAR_0;
                DMA_MAR_0 = DMA_MAR_0 + 1;
                fnLogTx0((unsigned char)US_THR_0);
                ulNewActions |= SEND_COM_0;
                (DMA_TCR_0)--;
                --(*ptrCnt);                                             // limit transmission in this TICK interval
            }
            if ((iMasks & DMA_CONTROLLER_0) == 0) {
                iDMA &= ~DMA_CONTROLLER_0;                               // transfer complete
                US_CSR_0 |= (ENDTX);                                     // simulate Tx int
                if ((US_MR_0 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= ASSERT_RTS_0;
                }
                if (DMA_IMR_0 & DMA_TRC) {                               // if interrupt enabled
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART0 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART0 = IR_PDCA0;
                        interrupt_call();                                // call UART 0 int handler
                    }
                }
            }
        }
        else {
            iMasks |= DMA_CONTROLLER_0;
        }
    }
    /*
    if (iDMA & DMA_CONTROLLER_1) {                                       // USART 1 Tx DMA
        if (US_PTSR_1 & PDC_TXTEN) {                                     // peripheral DMA transfer enabled
            ptrCnt = (int *)argv[THROUGHPUT_UART1];
            while (US_TCR_1 != 0) {
                if (*ptrCnt == 0) {
                    iMasks |= DMA_CONTROLLER_2;                          // no futher transmissions in this interval
                    break;
                }
                if ((US_MR_1 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= NEGATE_RTS_1;                
                }
                US_THR_1 = *(unsigned char *)US_TPR_1;
                US_TPR_1 = US_TPR_1 + 1;
                fnLogTx1((unsigned char)US_THR_1);
                ulNewActions |= SEND_COM_1;
                (US_TCR_1)--;
                --(*ptrCnt);                                             // limit transmission in this TICK interval
            }
            if ((iMasks & DMA_CONTROLLER_2) == 0) {
                iDMA &= ~DMA_CONTROLLER_2;                               // transfer complete
                US_CSR_1 |= (ENDTX);                                     // simulate Tx int
                if ((US_MR_1 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= ASSERT_RTS_1;
                    fnConfigSimSCI(1, ASSERT_RTS_COM_1, 0);              // negate control lines (RS485 uses negative logic)
//                  porta_in &= ~RTS_1;
                }
                if (US_IMR_1 & ENDTX) {                                  // if interrupt enabled
                    AIC_IPR |= USART1;
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART1 = IR_USART1;
                        interrupt_call();                                // call UART 1 int handler
                    }
                }
            }
        }
        else {
            iMasks |= DMA_CONTROLLER_2;
        }
    }
    if (iDMA & DMA_CONTROLLER_2) {                                       // USART 2 Tx DMA
        if (US_PTSR_2 & PDC_TXTEN) {                                     // peripheral DMA transfer enabled
            ptrCnt = (int *)argv[THROUGHPUT_UART2];
            while (US_TCR_2 != 0) {
                if (*ptrCnt == 0) {
                    iMasks |= DMA_CONTROLLER_4;                          // no futher transmissions in this interval
                    break;
                }
                if ((US_MR_2 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= NEGATE_RTS_2;                
                }
                US_THR_2 = *(unsigned char *)US_TPR_2;
                US_TPR_2 = US_TPR_2 + 1;
                fnLogTx2((unsigned char)US_THR_2);
                ulNewActions |= SEND_COM_2;
                (US_TCR_2)--;
                --(*ptrCnt);                                             // limit transmission in this TICK interval
            }
            if ((iMasks & DMA_CONTROLLER_4) == 0) {
                iDMA &= ~DMA_CONTROLLER_4;                               // transfer complete
                US_CSR_2 |= (ENDTX);                                     // simulate Tx int
                if ((US_MR_2 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= ASSERT_RTS_2;
                    fnConfigSimSCI(2, ASSERT_RTS_COM_2, 0);              // negate control lines (RS485 uses negative logic)
// TO DO            porta_in &= ~RTS_2;
                }
                if (US_IMR_2 & ENDTX) {                                  // if interrupt enabled
                    AIC_IPR |= USART2;
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART2 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART2 = IR_USART2;
                        interrupt_call();                                // call UART 2 int handler
                    }
                }
            }
        }
        else {
            iMasks |= DMA_CONTROLLER_4;
        }
    }
    if (iDMA & DMA_CONTROLLER_3) {                                       // USART 3 Tx DMA
        if (US_PTSR_3 & PDC_TXTEN) {                                     // peripheral DMA transfer enabled
            ptrCnt = (int *)argv[THROUGHPUT_UART3];
            while (US_TCR_3 != 0) {
                if (*ptrCnt == 0) {
                    iMasks |= DMA_CONTROLLER_6;                          // no futher transmissions in this interval
                    break;
                }
                if ((US_MR_3 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= NEGATE_RTS_3;
                }
                US_THR_3 = *(unsigned char *)US_TPR_3;
                US_TPR_3 = US_TPR_3 + 1;
                fnLogTx3((unsigned char)US_THR_3);
                ulNewActions |= SEND_COM_3;
                (US_TCR_3)--;
                --(*ptrCnt);                                             // limit transmission in this TICK interval
            }
            if ((iMasks & DMA_CONTROLLER_6) == 0) {
                iDMA &= ~DMA_CONTROLLER_6;                               // transfer complete
                US_CSR_3 |= (ENDTX);                                     // simulate Tx int
                if ((US_MR_3 & 0x7) == USART_MODE_RS485) {               // if in RS485 mode automatically control the RTS line
                    iRTS_action |= ASSERT_RTS_3;
                    fnConfigSimSCI(3, ASSERT_RTS_COM_3, 0);              // negate control lines (RS485 uses negative logic)
// TO DO            porta_in &= ~RTS_3;
                }
                if (US_IMR_3 & ENDTX) {                                  // if interrupt enabled
                    AIC_IPR |= USART3;
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART3 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART3 = IR_USART3;
                        interrupt_call();                                // call UART 3 int handler
                    }
                }
            }
        }
        else {
            iMasks |= DMA_CONTROLLER_6;
        }
    }*/
    if (NEGATE_RTS_0 & iRTS_action) {
        iRTS_action &= ~NEGATE_RTS_0;
        fnConfigSimSCI(0, NEGATE_RTS_COM_0, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
        port3_in |= PX03;
    #else
        port0_in |= PA03;
    #endif
    }
    else if (ASSERT_RTS_0 & iRTS_action) {
        iRTS_action &= ~ASSERT_RTS_0;
        fnConfigSimSCI(0, ASSERT_RTS_COM_0, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
        port3_in &= ~PX03;
    #else
        port0_in &= ~PA03;
    #endif
    }
    if (NEGATE_RTS_1 & iRTS_action) {
        iRTS_action &= ~NEGATE_RTS_1;
        fnConfigSimSCI(1, NEGATE_RTS_COM_1, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
        port2_in |= PX07;
    #else
        port0_in |= PA08;
    #endif
    }
    else if (ASSERT_RTS_1 & iRTS_action) {
        iRTS_action &= ~ASSERT_RTS_1;
        fnConfigSimSCI(1, ASSERT_RTS_COM_1, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
        port2_in &= ~PX07;
    #else
        port0_in &= ~PA08;
    #endif
    }
    if (NEGATE_RTS_2 & iRTS_action) {
        iRTS_action &= ~NEGATE_RTS_2;
        fnConfigSimSCI(2, NEGATE_RTS_COM_2, 0);                          // negate control lines (RS485 uses negative logic)
    #ifndef _AT32UC3C
        #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
        port3_in |= PX13;
        #elif defined USART2_RTS_ON_1
        port1_in |= PB01;
        #else
        port0_in |= PA29;
        #endif
    #endif
    }
    else if (ASSERT_RTS_2 & iRTS_action) {
        iRTS_action &= ~ASSERT_RTS_2;
        fnConfigSimSCI(2, ASSERT_RTS_COM_2, 0);                          // negate control lines (RS485 uses negative logic)
    #ifndef _AT32UC3C
        #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
        port3_in &= ~PX13;
        #elif defined USART2_RTS_ON_1
        port1_in &= ~PB01;
        #else
        port0_in &= ~PA29;
        #endif
    #endif
    }
    if (NEGATE_RTS_3 & iRTS_action) {
        iRTS_action &= ~NEGATE_RTS_3;
        fnConfigSimSCI(3, NEGATE_RTS_COM_3, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
        port2_in |= PX15;
    #else
        port1_in |= PB00;
    #endif
    }
    else if (ASSERT_RTS_3 & iRTS_action) {
        iRTS_action &= ~ASSERT_RTS_3;
        fnConfigSimSCI(3, ASSERT_RTS_COM_3, 0);                          // negate control lines (RS485 uses negative logic)
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
        port2_in &= ~PX15;
    #else
        port1_in &= ~PB00;
    #endif
    }
#endif
    return ulNewActions;
}


