sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
#ifdef SPI_SIM_INTERFACE
// Simulate the reception of SPI slave data by inserting bytes into the input buffer and calling interrupts
//
extern void fnSimulateSPIIn(int iPort, unsigned char *ptrDebugIn, unsigned short usLen)
{
    void (*interrupt_call)(void);

    if (iPort == 1) {
        if (SPI_CR_1 & SPIEN) {                                          // only accept if the interface is enabled
            if (SPI_MR_1 & SPI_MSTR) {                                   // no unsolicited reception in master mode
                return;
            }
            if (SPI_CSR0_1 & 0xf0) {                                     // check whether the reception length is longer than 8 bits
                static int iCount = 0;
                unsigned char ucMask = (unsigned char)(SPI_CSR0_1 >> 4);
                ucMask = (0xff >> (8 - ucMask));
                while (usLen--) {
                    SPI_RDR_1 <<= 8;                                     // clear space for first byte
                    if (iCount == 0) {
                        iCount = 1;
                        SPI_RDR_1 |= (*ptrDebugIn++ & ucMask);           // add first bits
                    }
                    else {
                        iCount = 0;
                        SPI_RDR_1 |= *ptrDebugIn++;                      // add last 8 bits
                        SPI_SR_1 |= SPI_RDRF;                            // set rx ready flag
                        AIC_IPR |= SPI1;
                        if (AIC_IMR  & SPI1) {                           // if interrupt is enabled call the handling routine
                            interrupt_call = (void (*)(void))AIC_SVR5;
                            interrupt_call();
                        }
                    } 
                }
            }
            else {
                while (usLen--) {
                    SPI_RDR_1 |= *ptrDebugIn++;                          // add 8 bits
                    SPI_SR_1 |= SPI_RDRF;                                // set rx ready flag
                    AIC_IPR |= SPI1;
                    if (AIC_IMR  & SPI1) {                               // if interrupt is enabled call the handling routine
                        interrupt_call = (void (*)(void))AIC_SVR5;
                        interrupt_call();
                    }
                }
            }
        }
    }
    else if (iPort == 0) {
    }
}
#endif

static void fnModemChange(unsigned long ulInput, int iState, int iSetPort)
{
    /*
    if ((!(PIO_PSR_A & ulInput)) && (!(PIO_ABSR_A & ulInput))) {         // if input programmed for CTS operation
        unsigned char ucBit = 30;
        unsigned long ulPin = ulInput;
        while (!(ulPin & 0x00000001)) {
            ulPin >>= 1;
            ucBit--;
        }
        if (iState != 0) {                                               // CTS has just been activated
            if (iSetPort != 0) {
                fnSimulateInputChange(0, ucBit, CLEAR_INPUT);
                return;
            }
            if (ulInput & CTS_0) {
                US_CSR_0 &= ~CTS_HIGH;
            }
            else {
                US_CSR_1 &= ~CTS_HIGH;
            }
        }
        else {                                                           // CTS has just been deactivated
            if (iSetPort != 0) {
                fnSimulateInputChange(0, ucBit, SET_INPUT);
                return;
            }
            if (ulInput & CTS_0) {
                US_CSR_0 |= CTS_HIGH;
            }
            else {
                US_CSR_1 |= CTS_HIGH;
            }
        }
        if (ulInput & CTS_0) {
            US_CSR_0 |= CTSIC;                                           // flag CTS change
            if ((AIC_IMR & USART0) && (US_IMR_0 & CTSIC)) {              // if interrupt is enabled
                void (*interrupt_call)(void);
                AIC_IPR |= USART0;
                interrupt_call = (void (*)(void))AIC_SVR6;               // call UART0 interrup routine
                interrupt_call();
            }
        }
        else {
            US_CSR_1 |= CTSIC;                                           // flag CTS change
            if ((AIC_IMR & USART1) && (US_IMR_1 & CTSIC)) {              // if interrupt is enabled
                void (*interrupt_call)(void);
                AIC_IPR |= USART1;
                interrupt_call = (void (*)(void))AIC_SVR7;               // call UART1 interrup routine
                interrupt_call();
            }
        }
    }*/
}


extern void fnSimulateModemChange(int iPort, unsigned long ulNewState, unsigned long ulOldState)
{
#if defined SUPPORT_HW_FLOW
// Note that the modem status bits are according to the MS specifications as passed by GetCommModemStatus().
// To avoid including MS headers, the bits are defined here - it is not expected that they will ever change...
#define MS_CTS_ON  0x0010
#define MS_DSR_ON  0x0020
#define MS_RING_ON 0x0040
#define MS_RLSD_ON 0x0080                                                // carrier detect
    #if defined SUPPORT_HW_FLOW
    unsigned long ulChange = (ulNewState ^ ulOldState);
    switch (iPort) {
    case 0:                                                              // USART 0
        if (ulChange & MS_CTS_ON) {
        #if defined USART0_CTS_ON_3 && defined CHIP_144_PIN
            fnModemChange(PX02, ((ulNewState & MS_CTS_ON) != 0), 3);
        #else
            fnModemChange(PA04, ((ulNewState & MS_CTS_ON) != 0), 0);
        #endif
        }
        break;
    case 1:                                                              // USART 1
        if (ulChange & MS_CTS_ON) {
        #if defined USART1_CTS_ON_2 && defined CHIP_144_PIN
            fnModemChange(PX07, ((ulNewState & MS_CTS_ON) != 0), 2);
        #else
            fnModemChange(PA08, ((ulNewState & MS_CTS_ON) != 0), 0);
        #endif
        }
        break;
    case 2:                                                              // USART 2
        if (ulChange & MS_CTS_ON) {
        #if defined USART2_CTS_ON_3 && defined CHIP_144_PIN
            fnModemChange(PX12, ((ulNewState & MS_CTS_ON) != 0), 3);
        #elif defined USART2_CTS_ON_1
            fnModemChange(PB01, ((ulNewState & MS_CTS_ON) != 0), 1);
        #else
            fnModemChange(PA30, ((ulNewState & MS_CTS_ON) != 0), 0);
        #endif
        }
        break;
    case 4:                                                              // USART 3
        if (ulChange & MS_CTS_ON) {
        #if defined USART3_CTS_ON_2 && defined CHIP_144_PIN
            fnModemChange(PX16, ((ulNewState & MS_CTS_ON) != 0), 2);
        #else
            fnModemChange(PB01, ((ulNewState & MS_CTS_ON) != 0), 1);
        #endif
        }
        break;
    }
    #endif
#endif
}

// UART Break detection simulation
//
extern void fnSimulateBreak(int iPort)
{
}

// Dummy
//
extern void RealTimeInterrupt(void)
{
}


