sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
// Simulate buffers for Ethernet use
//
unsigned char ucSimRxABuf[1536];
unsigned char ucSimRxBBuf[1536];

unsigned char *fnGetSimTxBufferAdd(void)
{
#ifdef ETH_INTERFACE
    return (fnGetTxBufferAdd(0));
#else
    return 0;
#endif
}

#ifdef ETH_INTERFACE
    extern int fnCheckEthernetMode(unsigned char *ucData, unsigned short usLen);
#endif

extern int fnSimulateEthernetIn(unsigned char *ucData, unsigned short usLen, int iForce)
{
#ifdef ETH_INTERFACE                                                     // we feed frames in promiscuous mode and filter them according to their details
    int iType = 0;
    unsigned long ulTemp;
    static int iFirstRec = 0;
    static AVR32_RX_BD *ptrStartRxBd;
    AVR32_RX_BD *ptrRxBd;
    unsigned short usFrameLength = usLen;
    int iFirstBuffer = 1;


    if ((!iForce) && (!(iType = fnCheckEthernetMode(ucData, usLen)))) {  // if we are not in promiscuous mode and the MAC address is not defined to be received we ignore the frame
        return 0;         
    }

    if (!iFirstRec) {                                                    // we play at being the EMAC receiver
        ptrStartRxBd = (AVR32_RX_BD *)MACB_RBQP;                         // get the first buffer descriptor address and remember it
        iFirstRec = 1;                                                   // don't let it happen again
    }
    ptrRxBd = (AVR32_RX_BD *)MACB_RBQP;


    ptrRxBd->bd_details = BD_INFO_START_OF_FRAME;

    while (usLen) {
        ulTemp = (unsigned long)ptrRxBd->ptrBlock;

        if (ulTemp & BD_OWNERSHIP) return 0;                             // check ownership and ignore if the buffer is blocked

        ulTemp &= ~(BD_RX_WRAP | BD_OWNERSHIP);                          // mask out flags to leave the address
        if (usLen >= 128) {
            uMemcpy((unsigned char*)ulTemp, ucData, 128);                // copy the receive data to the input buffer
            ucData += 128;
            usLen -= 128;
            ptrRxBd->bd_details &= ~BD_INFO_END_OF_FRAME;
        }
        else {
            uMemcpy((unsigned char *)ulTemp, ucData, usLen);             // copy the receive data to the input buffer
            usLen = 0;
        }
        if (!iFirstBuffer) {
            ptrRxBd->bd_details &= ~BD_INFO_START_OF_FRAME;
        }
        iFirstBuffer = 0;

        if (usLen == 0) {
            ptrRxBd->bd_details |= BD_INFO_END_OF_FRAME;                 // mark end of frame in this buffer
            if (iType == 1) {
                ptrRxBd->bd_details |= BD_INFO_GLOBAL_FRAME;             // mark broadcast frame received
            }
            else if (iType == 2) {
                ptrRxBd->bd_details |= BD_INFO_SPECIFIC_ADD_1_MATCH;     // mark MAC address match
            }
            if (usFrameLength > 1536) {
                usFrameLength = 0;
            }
            ptrRxBd->bd_details &= ~BD_INFO_LENGTH_OF_FRAME_MASK;        // clear any old info (shoudln't really be there..)
            ptrRxBd->bd_details |= usFrameLength;                        // add frame length received
            if ((unsigned short)(ptrRxBd->bd_details & BD_INFO_LENGTH_OF_FRAME_MASK) > 1536) {
                usFrameLength = 0;
            }
        }

        ulTemp = (unsigned long)ptrRxBd->ptrBlock;
        ulTemp |= (BD_OWNERSHIP);                                        // mark written to
        ptrRxBd->ptrBlock = (unsigned char *)ulTemp;

        if ((unsigned long)(ptrRxBd->ptrBlock) & BD_RX_WRAP) {           // check whether this is the last in the list
            ptrRxBd = ptrStartRxBd;
        }
        else {
            ptrRxBd++;                                                   // increment to next buffer descriptor
        }
    }

    MACB_RBQP = (unsigned long)ptrRxBd;                                  // update the present buffer pointer
    MACB_ISR |= RCOMP;                                                   // set interrupt flag
    MACB_RSR |= RSR_REC;                                                 // set receive status flag
    if (!(ulAVR32_CPU.SR & GM)) {                                        // global interrupt not masked
        void (*interrupt_call)(void);
        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_MACB & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
        IRR_MACB = IR_MACB;
        interrupt_call();                                                // call MACB 0 int handler
    }
    return 1;
#else
    return 0;
#endif
}

// The PHY interrupt line is pulled low to simulate change of PHY state
//
extern void fnSimulateLinkUp(void)
{
#if defined ETH_INTERFACE && defined PHY_INTERRUPT && defined SUPPORT_PORT_INTERRUPTS // {13}
    unsigned char ucBit = 31;
    unsigned long ulBit = PHY_INTERRUPT;
    while (ulBit > 1) {
        ulBit >>= 1;
        ucBit--;
    }
    fnSimulateInputChange(PORT_PHY_INT, ucBit, CLEAR_INPUT);   
#endif
    fnUpdateIPConfig();                                                  // update display in simulator
}


// We can update port state displays if we want
//
extern void fnSimPorts(int iThisPort)
{
    fnSimPortsAVR(0);
#if !defined _AT32UC3B || !defined CHIP_48_PIN
    fnSimPortsAVR(1);
#endif
#ifndef _AT32UC3B
    fnSimPortsAVR(2);
    fnSimPortsAVR(3);
#endif

#if defined SUPPORT_HW_FLOW
    if (US_CR_0 & (AVR32_RTSEN | AVR32_RTSDIS)) {                        // handle RTS changes on USARTs
        if (US_CR_0 & AVR32_RTSEN) {
            fnConfigSimSCI(0, ASSERT_RTS_COM_0, 0);                      // assert control line
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
            port3_in &= ~PX03;
    #else
            port0_in &= ~PA03;
    #endif
        }
        if (US_CR_0 & AVR32_RTSDIS) {
            fnConfigSimSCI(0, NEGATE_RTS_COM_0, 0);                      // negate control line
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
            port3_in |= PX03;
    #else
            port0_in |= PA03;
    #endif
        }
        US_CR_0 = 0;
    }
    if (US_CR_1 & (AVR32_RTSEN | AVR32_RTSDIS)) {
        if (US_CR_1 & AVR32_RTSEN) {
            fnConfigSimSCI(1, ASSERT_RTS_COM_1, 0);                      // assert control line
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
            port2_in &= ~PX07;
    #else
            port0_in &= ~PA08;
    #endif
        }
        if (US_CR_1 & AVR32_RTSDIS) {
            fnConfigSimSCI(1, NEGATE_RTS_COM_1, 0);                      // negate control line
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
            port2_in |= PX07;
    #else
            port0_in |= PA08;
    #endif
        }
        US_CR_1 = 0;
    }
    if (US_CR_2 & (AVR32_RTSEN | AVR32_RTSDIS)) {
        if (US_CR_2 & AVR32_RTSEN) {
            fnConfigSimSCI(2, ASSERT_RTS_COM_2, 0);                      // assert control line
    #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
            port3_in &= ~PX13;
    #elif defined USART2_RTS_ON_1
            port1_in &= ~PB01;
    #else
            port0_in &= ~PA29;
    #endif
        }
        if (US_CR_2 & AVR32_RTSDIS) {
            fnConfigSimSCI(2, NEGATE_RTS_COM_2, 0);                      // negate control line
    #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
            port3_in |= PX13;
    #elif defined USART2_RTS_ON_1
            port1_in |= PB01;
    #else
            port0_in |= PA29;
    #endif
        }
        US_CR_2 = 0;
    }
    if (US_CR_3 & (AVR32_RTSEN | AVR32_RTSDIS)) {
        if (US_CR_3 & AVR32_RTSEN) {
            fnConfigSimSCI(3, ASSERT_RTS_COM_3, 0);                      // assert control line
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
            port2_in &= ~PX15;
    #else
            port1_in &= ~PB00;
    #endif
        }
        if (US_CR_3 & AVR32_RTSDIS) {
            fnConfigSimSCI(3, NEGATE_RTS_COM_3, 0);                      // negate control line
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
            port2_in |= PX15;
    #else
            port1_in |= PB00;
    #endif
        }
        US_CR_3 = 0;
    }
#endif
}

extern int fnPortChanges(int iForce)
{
    static unsigned long ulPortA = 0, ulPortB = 0;
    int iRtn = iFlagRefresh;
    iFlagRefresh = 0;
    if (iForce == 0) {                                                   // on tick
        if ((usIdleCounter0 != 0) && (US_BRGR_0 != 0)) {                 // idle bit period counter active on UART0
            unsigned long ulTickBitCount = (((MASTER_CLOCK/1000)*(TICK_RESOLUTION /1000))/(US_BRGR_0*16)); // bit periods in a tick
            if (ulTickBitCount >= usIdleCounter0) {
                usIdleCounter0 = 0;
                US_CSR_0 |= RX_TIMEOUT;                                  // set the timeout bit in the status register
                if (US_IMR_0 & RX_TIMEOUT) {                             // if timeout interrupt enabled
                    while (US_CSR_0 & RX_TIMEOUT) {
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART0 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART0 = IR_USART0;
                        interrupt_call();
                        if (US_CR_0 & AVR32_RETTO) {
                            usIdleCounter0 = (unsigned short)US_RTOR_0;  // reset next timeout
                        }
                        if (US_CR_0 & AVR32_STTTO) {                     // reset the interrupt but don't start new timeout until next character received
                            US_CSR_0 &= ~RX_TIMEOUT;
                        }
                        US_CR_0 = 0;
                    }
                }
            }
            else {
                usIdleCounter0 -= (unsigned short)ulTickBitCount;
            }
        }
        if ((usIdleCounter1 != 0) && (US_BRGR_1 != 0)) {                 // idle bit period counter active on UART1
            unsigned long ulTickBitCount = (((MASTER_CLOCK/1000)*(TICK_RESOLUTION /1000))/(US_BRGR_1*16)); // bit periods in a tick
            if (ulTickBitCount >= usIdleCounter1) {
                usIdleCounter1 = 0;
                US_CSR_1 |= RX_TIMEOUT;                                  // set the timeout bit in the status register
                if (US_IMR_1 & RX_TIMEOUT) {                             // if timeout interrupt enabled
                    while (US_CSR_1 & RX_TIMEOUT) {
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART1 = IR_USART1;
                        interrupt_call();
                        if (US_CR_1 & AVR32_RETTO) {
                            usIdleCounter1 = (unsigned short)US_RTOR_1;  // reset next timeout
                        }
                        if (US_CR_1 & AVR32_STTTO) {                     // reset the interrupt but don't start new timeout until next character received
                            US_CSR_1 &= ~RX_TIMEOUT;
                        }
                        US_CR_1 = 0;
                    }
                }
            }
            else {
                usIdleCounter1 -= (unsigned short)ulTickBitCount;
            }
        }
        if ((usIdleCounter2 != 0) && (US_BRGR_2 != 0)) {                 // idle bit period counter active on UART1
            unsigned long ulTickBitCount = (((MASTER_CLOCK/1000)*(TICK_RESOLUTION / 1000))/(US_BRGR_2*16)); // bit periods in a tick
            if (ulTickBitCount >= usIdleCounter2) {
                usIdleCounter2 = 0;
                US_CSR_2 |= RX_TIMEOUT;                                  // set the timeout bit in the status register
                if (US_IMR_2 & RX_TIMEOUT) {                             // if timeout interrupt enabled
                    while (US_CSR_2 & RX_TIMEOUT) {
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART2 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART2 = IR_USART2;
                        interrupt_call();
                        if (US_CR_2 & AVR32_RETTO) {
                            usIdleCounter2 = (unsigned short)US_RTOR_2;  // reset next timeout
                        }
                        if (US_CR_2 & AVR32_STTTO) {                     // reset the interrupt but don't start new timeout until next character received
                            US_CSR_2 &= ~RX_TIMEOUT;
                        }
                        US_CR_2 = 0;
                    }
                }
            }
            else {
                usIdleCounter2 -= (unsigned short)ulTickBitCount;
            }
        }
        if ((usIdleCounter3 != 0) && (US_BRGR_3 != 0)) {                 // idle bit period counter active on UART1
            unsigned long ulTickBitCount = (((MASTER_CLOCK/1000)*(TICK_RESOLUTION / 1000))/(US_BRGR_3*16)); // bit periods in a tick
            if (ulTickBitCount >= usIdleCounter3) {
                usIdleCounter3 = 0;
                US_CSR_3 |= RX_TIMEOUT;                                  // set the timeout bit in the status register
                if (US_IMR_3 & RX_TIMEOUT) {                             // if timeout interrupt enabled
                    while (US_CSR_3 & RX_TIMEOUT) {
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART3 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR_UART3 = IR_USART3;
                        interrupt_call();
                        if (US_CR_3 & AVR32_RETTO) {
                            usIdleCounter3 = (unsigned short)US_RTOR_3;  // reset next timeout
                        }
                        if (US_CR_3 & AVR32_STTTO) {                     // reset the interrupt but don't start new timeout until next character received
                            US_CSR_3 &= ~RX_TIMEOUT;
                        }
                        US_CR_3 = 0;
                    }
                }
            }
            else {
                usIdleCounter3 -= (unsigned short)ulTickBitCount;
            }
        }
    }
    return iRtn;
}



#ifdef SUPPORT_ADC
static void fnSimADC(int iChannel)
{
    ADC_SR |= (0x01 << iChannel);                                        // set conversion complete bit for the channel
    *(ADC_CDR0_ADD + iChannel) = (unsigned short)ulADC_values[iChannel]; // set the sample to the channel input register
    ADC_LCDR = (unsigned short)ulADC_values[iChannel];                   // set the sample to the last data register
    ADC_SR |= DRDY;                                                      // set the data ready bit
}

// Capture the present input, if enabled
//
extern void fnUpdateADC(int iChannel)
{
    if (iChannel < ADC_CHANNELS) {
        if (ADC_CHSR & (0x01 << iChannel)) {                             // if channel is not disabled
            fnSimADC(iChannel);                                          // update present sample
        }
    }
    else {
        iChannel = 0;
        while (iChannel < ADC_CHANNELS) {
            if (ADC_CHSR & (0x01 << iChannel)) {                         // if channel is not disabled
                fnSimADC(iChannel);                                      // update present sample
            }
            iChannel++;
        }
    }
}

static void fnADC_trigger(void)
{
    unsigned long ulBit = 0x01;
    int iChannel = 0;
    ADC_CR = 0;
    while (ulBit <= 0x80) {
        if (ADC_CHSR & ulBit) {                                          // channel active
            fnSimADC(iChannel);                                          // sample each active channel
            /*
            if (ADC_PTCR & PDC_RXTEN) {                                  // PDC connected
                if (ADC_RCR != 0) {                                      // transfers remaining
                    if (ADC_MR & LOWRES) {                               // 8 bit mode
                        *(unsigned char *)(ADC_RPR) = (unsigned char)ADC_LCDR;
                        (ADC_RPR)++;
                    }
                    else {                                                // 10 bit mode
                        *(unsigned short *)(ADC_RPR) = (unsigned short)ADC_LCDR;
                        (ADC_RPR)++;
                        (ADC_RPR)++;
                    }
                    (ADC_RCR)--;
                    if (ADC_RCR == 0) {                                  // last transfer
                        ADC_SR |= ADC_ENDRX;
                        if (ADC_IMR & ADC_ENDRX) {
                            void (*int_routine)( void) = (void *)AIC_SVR17;
                            int_routine();                                    
                        }
                    }
                }
            }*/
        }
        iChannel++;
        ulBit <<= 1;
    }
    while (ADC_IMR & (DRDY | EOC0 | EOC1 | EOC2 | EOC3 | EOC4 | EOC5 | EOC6 | EOC7) & ADC_SR) { // if end of conversion interrupt (or data read interrupt) enabled
        if (!(ulAVR32_CPU.SR & GM)) {                                    // global interrupt not masked
            void (*interrupt_call)(void);
            interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR15 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
            IRR15 = IR_ADC;
            interrupt_call();                                            // call ADC int handler
        }
    }
}

#endif



#ifdef SUPPORT_KEY_SCAN

#if KEY_COLUMNS == 0                                                     // {10}
    #define _NON_MATRIX
    #undef KEY_COLUMNS
    #define KEY_COLUMNS  VIRTUAL_KEY_COLUMNS
    #undef KEY_ROWS
    #define KEY_ROWS VIRTUAL_KEY_ROWS
#endif

