sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
#if !defined _NON_MATRIX                                                 // {10}
    switch (iRowInput) {
    case 0:
    #ifdef KEY_ROWS
        fnSimulateInputChange(KEY_ROW_IN_PORT_1_REF, fnMapPortBit(KEY_ROW_IN_1), iChange);
    #endif
        break;
    case 1:
    #if KEY_ROWS > 1
        fnSimulateInputChange(KEY_ROW_IN_PORT_2_REF, fnMapPortBit(KEY_ROW_IN_2), iChange);
    #endif
        break;
    case 2:
    #if KEY_ROWS > 2
        fnSimulateInputChange(KEY_ROW_IN_PORT_3_REF, fnMapPortBit(KEY_ROW_IN_3), iChange);
    #endif
        break;
    case 3:
    #if KEY_ROWS > 3
        fnSimulateInputChange(KEY_ROW_IN_PORT_4_REF, fnMapPortBit(KEY_ROW_IN_4), iChange);
    #endif
        break;
    case 4:
    #if KEY_ROWS > 4
        fnSimulateInputChange(KEY_ROW_IN_PORT_5_REF, fnMapPortBit(KEY_ROW_IN_5), iChange);
    #endif
        break;
    case 5:
    #if KEY_ROWS > 5
        fnSimulateInputChange(KEY_ROW_IN_PORT_6_REF, fnMapPortBit(KEY_ROW_IN_6), iChange);
    #endif
        break;
    case 6:
    #if KEY_ROWS > 6
        fnSimulateInputChange(KEY_ROW_IN_PORT_7_REF, fnMapPortBit(KEY_ROW_IN_7), iChange);
    #endif
        break;
    case 7:
    #if KEY_ROWS > 7
        fnSimulateInputChange(KEY_ROW_IN_PORT_8_REF, fnMapPortBit(KEY_ROW_IN_8), iChange);
    #endif
        break;
    }
#endif
}

// This routine updates the ports to respect the present setting of a connected matrix key pad
//
extern void fnSimMatrixKB(void)
{
    int i, j;
    iFlagRefresh = fnPortChanges(1);                                     // synchronise with present settings                                                                         
    for (i = 0; i < KEY_COLUMNS; i++) {                                  // check whether a column control is being driven low. If this is the case, any pressed ones in the column are seen at the row input
        if (fnColumnLow(i)) {
            for (j = 0; j < KEY_ROWS; j++) {
                fnSetRowInput(j, iKeyPadInputs[i][j]);
            }
        }
    }
}
#endif

#ifdef USB_INTERFACE

static unsigned char ucDPRAM[SIZE_OF_DPRAM];                             // dual-port RAM shared by USB endpoints
static unsigned char *ptrDPRAM_area[NUMBER_OF_USB_ENDPOINTS] = {0};
static unsigned short usSizeEndpoint[NUMBER_OF_USB_ENDPOINTS] = {0};
static int iAllocated[NUMBER_OF_USB_ENDPOINTS] = {0};

/*
static unsigned char ucEndpointFifoIn0[8];                               // AVR32 endpoint rx FIFOs - no DMA on endpoint 0
static unsigned char ucEndpointFifoIn1[2][64];
static unsigned char ucEndpointFifoIn2[2][64];
static unsigned char ucEndpointFifoIn3[2][64];
static unsigned char ucEndpointFifoIn4[2][64];
static unsigned char ucEndpointFifoIn5[2][256];
static unsigned char ucEndpointFifoIn6[2][256];

static unsigned char ucEndpointFifoOut0[8 + sizeof(unsigned short)];      // AVR32 endpoint tx FIFOs (when simulating transmission, first 2 bytes are used to hold the valid length)
static unsigned char ucEndpointFifoOut1[2][64 + sizeof(unsigned short)];
static unsigned char ucEndpointFifoOut2[2][64 + sizeof(unsigned short)];
static unsigned char ucEndpointFifoOut3[2][64 + sizeof(unsigned short)];
static unsigned char ucEndpointFifoOut4[2][64 + sizeof(unsigned short)];
static unsigned char ucEndpointFifoOut5[2][256 + sizeof(unsigned short)];
static unsigned char ucEndpointFifoOut6[2][256 + sizeof(unsigned short)];
*/

extern volatile unsigned char *fnGetUSB_FIFOAdd(volatile unsigned char *ptrAdd, int iDirection)
{  
    if (iDirection != 0) {                                               // transmission buffer
        if (USBB_HSB_0 == ptrAdd) {
            return ucDPRAM;                                              // control endpoint 0 always uses the first area of the DPRAM
        }
        /*
        if (UDP_FDR1_ADD == ptrAdd) {
            return ucEndpointFifoOut1[0];
        }
        if (UDP_FDR2_ADD == ptrAdd) {
            return ucEndpointFifoOut2[0];
        }
        if (UDP_FDR3_ADD == ptrAdd) {
            return ucEndpointFifoOut3;
        }
        if (UDP_FDR4_ADD == ptrAdd) {
            return ucEndpointFifoOut4[0];
        }
        if (UDP_FDR5_ADD == ptrAdd) {
            return ucEndpointFifoOut5[0];
        }
        if (UDP_FDR6_ADD == ptrAdd) {
            return ucEndpointFifoOut6[0];
        }*/
    }
    else {
        if (USBB_HSB_0 == ptrAdd) {
            return ucDPRAM;                                              // control endpoint 0 always uses the first area of the DPRA
        }/*
        if (UDP_FDR1_ADD == ptrAdd) {
            return ucEndpointFifoIn1[0];
        }
        if (UDP_FDR2_ADD == ptrAdd) {
            return ucEndpointFifoIn2[0];
        }
        if (UDP_FDR3_ADD == ptrAdd) {
            return ucEndpointFifoIn3;
        }
        if (UDP_FDR4_ADD == ptrAdd) {
            return ucEndpointFifoIn4[0];
        }
        if (UDP_FDR5_ADD == ptrAdd) {
            return ucEndpointFifoIn5[0];
        }
        if (UDP_FDR6_ADD == ptrAdd) {
            return ucEndpointFifoIn6[0];
        }*/
    }
    return ptrAdd;
}

static void fnCheckAllocation(int iEndpoint)
{
    if (iAllocated[iEndpoint] == 0) {                                    // if endpoint allocation has not been registered do it now
        unsigned short usSize = 0;
        unsigned char *ptrDRAM = ucDPRAM;
        switch (iEndpoint) {
        case 0:                                                          // control endpoint - not reset
            switch (UECFG0 & UECFG_EPSIZE_1024) {
            case UECFG_EPSIZE_8:
                usSize = 8;
                break;
            case UECFG_EPSIZE_16:
                usSize = 16;
                break;
            case UECFG_EPSIZE_32:
                usSize = 32;
                break;
            case UECFG_EPSIZE_64:
                usSize = 64;
                break;
            default:
                *(unsigned char*)(0) = 0;                                // exception on invalid setting for this endpoint
                break;
            }
            break;
        }
        usSizeEndpoint[iEndpoint] = usSize;
        ptrDPRAM_area[iEndpoint] = ptrDRAM;
        iAllocated[iEndpoint] = 1;
    }
}

// Inject USB transactions for test purposes
//
extern int fnSimulateUSB(int iChannel, int iDevice, int iEndPoint, unsigned char ucPID, unsigned char *ptrDebugIn, unsigned short usLenEvent)
{
    if (ptrDebugIn == 0) {
        switch (usLenEvent) {
        case USB_RESET_CMD:
            memset(iTxDataToggle, 0, sizeof(iTxDataToggle));
            memset(iRxDataBank, 0, sizeof(iRxDataBank));
            memset(ulTxDataBank, 0, sizeof(ulTxDataBank));
            UDINT |= UDINT_EORST;                                        // flag that a USB bus reset has been detected
            UDCON &= ~(UDCON_ADDMASK | UDCON_ADDEN);                     // clear address
            break;
        case USB_SLEEP_CMD:
            UDINT |= UDINT_SUSP;                                         // flag that a USB bus suspend has been detected
            break;
        case USB_RESUME_CMD:
            UDINT |= UDINT_EORSM;                                        // flag that a USB bus resume has been detected
            break;
        case USB_STALL_SUCCESS:
        case USB_IN_SUCCESS:
            break;
        default:
            return 0;
        }
    }
    else {                                                               // data being injected
        unsigned long ulEndpointConfig;
        if ((UDCON & UDCON_ADDMASK) != (unsigned char)iDevice) {         // not our device address so ignore
            if (iDevice != 0xff) {                                       // special broadcast for simulator use so that it doesn't have to know the USB address
                return 1;
            }
        }
        fnCheckAllocation(iEndPoint);
        switch (iEndPoint) {
        case 0:                                                          // endpoint 0 - control/bulk/interrupt - max endpoint size 8 bytes - not dual-banked
            if ((UERST & (EPEN0 | EPRST0)) != EPEN0) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UECFG0 & (UECFG_EPTYPE_INTERRUPT | UECFG_EPDIR_IN));
            UPSTA0 = ((usLenEvent << RXBYTECNT_SHIFT) | RXINE | TXOUTE);
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UESTA0 = (RXSTPI | TXINI);                               // mark that a setup token has been received and that IN frames can be sent
              //UDP_CSR0 |= RXSETUP; ??
              //ulTxDataBank[0] = DTGLE; ??                              // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                UESTA0 = (RXOUTI | TXINI | (((unsigned long)usLenEvent << BYCT_SHIFT) & BYCT_MASK)); // OUT frame with length
              //ulTxDataBank[0] ^= DTGLE; ??
              //UDP_CSR0 |= ulTxDataBank[0]; ??
            }
            if (usLenEvent > usSizeEndpoint[0]) {                        // limit data length to the FIFO length
                usLenEvent = usSizeEndpoint[0];
            }
            memcpy(ptrDPRAM_area[0], ptrDebugIn, usLenEvent);
            UDINT |= UDINT_EP0;                                          // set endpoint 0 interrupt
            break;
            /*
        case 1:                                                          // endpoint 1 - bulk/iso/interrupt - max endpoint size 64 bytes - dual-banked
            if (!(UDP_CSR1 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR1 & (EPTYPE_INTERRUPT_IN | EPEDS));
            if (iRxDataBank[1] == 0) {                                   // simulate dual bank operation
                ulEndpointConfig |= RX_DATA_BK0;
            }
            else {
                ulEndpointConfig |= RX_DATA_BK1;
            }
            iRxDataBank[1] ^= 1;
            UDP_CSR1 = ((usLenEvent << RXBYTECNT_SHIFT) | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR1 |= RXSETUP;
                ulTxDataBank[1] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[1] ^= DTGLE; 
                UDP_CSR1 |= ulTxDataBank[1];
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn1)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn1);
            }
            memcpy(ucEndpointFifoIn1, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP1INT;
            break;
        case 2:                                                          // endpoint 2 - bulk/iso/interrupt - max endpoint size 64 bytes - dual-banked
            if (!(UDP_CSR2 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR2 & (EPTYPE_INTERRUPT_IN | EPEDS));
            UDP_CSR2 = ((usLenEvent << RXBYTECNT_SHIFT) | RX_DATA_BK0 | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR2 |= RXSETUP;
                ulTxDataBank[2] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[2] ^= DTGLE; 
                UDP_CSR2 |= ulTxDataBank[2];
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn2)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn2);
            }
            memcpy(ucEndpointFifoIn2, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP2INT;
            break;
        case 3:                                                          // endpoint 3 - control/bulk/interrupt - max endpoint size 64 bytes - not dual-banked
            if (!(UDP_CSR3 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR3 & (EPTYPE_INTERRUPT_IN | EPEDS));
            UDP_CSR3 = ((usLenEvent << RXBYTECNT_SHIFT) | RX_DATA_BK0 | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR3 |= RXSETUP;
                ulTxDataBank[3] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[3] ^= DTGLE; 
                UDP_CSR3 |= ulTxDataBank[3];
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn3)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn3);
            }
            memcpy(ucEndpointFifoIn3, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP3INT;
            break;
        case 4:                                                          // endpoint 4 - bulk/iso/interrupt - max endpoint size 256 bytes - dual-banked
            if (!(UDP_CSR4 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR4 & (EPTYPE_INTERRUPT_IN | EPEDS));
            UDP_CSR4 = ((usLenEvent << RXBYTECNT_SHIFT) | RX_DATA_BK0 | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR4 |= RXSETUP;
                ulTxDataBank[4] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[4] ^= DTGLE;
                UDP_CSR4 |= ulTxDataBank[4]; 
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn4)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn4);
            }
            memcpy(ucEndpointFifoIn4, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP4INT;
            break;
        case 5:                                                          // endpoint 5 - bulk/iso/interrupt - max endpoint size 256 bytes - dual-banked
            if (!(UDP_CSR5 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR5 & (EPTYPE_INTERRUPT_IN | EPEDS));
            UDP_CSR5 = ((usLenEvent << RXBYTECNT_SHIFT) | RX_DATA_BK0 | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR5 |= RXSETUP;
                ulTxDataBank[5] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[5] ^= DTGLE; 
                UDP_CSR5 |= ulTxDataBank[5];
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn5)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn5);
            }
            memcpy(ucEndpointFifoIn5, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP5INT;
            break;
        }
        case 6:                                                          // endpoint 6 - bulk/iso/interrupt - max endpoint size 256 bytes - dual-banked
            if (!(UDP_CSR6 & EPEDS)) {
                return 1;                                                // endpoint not enabled so ignore
            }
            ulEndpointConfig = (UDP_CSR5 & (EPTYPE_INTERRUPT_IN | EPEDS));
            UDP_CSR5 = ((usLenEvent << RXBYTECNT_SHIFT) | RX_DATA_BK0 | ulEndpointConfig); // data length
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                UDP_CSR6 |= RXSETUP;
                ulTxDataBank[6] = DTGLE;                                 // always a DATA1 after a SETUP pid
            }
            else if (OUT_PID == ucPID) {
                ulTxDataBank[6] ^= DTGLE; 
                UDP_CSR6 |= ulTxDataBank[5];
            }
            if (usLenEvent > sizeof(ucEndpointFifoIn6)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn6);
            }
            memcpy(ucEndpointFifoIn6, ptrDebugIn, usLenEvent); 
            UDP_ISR = EP6INT;
            break;
        */
        }
    }
    if (UDINTE & UDINT) {                                                // USBB interrupt enabled
        if (!(ulAVR32_CPU.SR & GM)) {                                    // global interrupt not masked
            void (*interrupt_call)(void);
            interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR17 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
            IRR17 = IR_USBB;
            interrupt_call();                                            // call USBB int handler
        }
    }
    return 0;
}


