sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
// Handle data sent by USB
//
extern void fnSimUSB(int iChannel, int iType, int iEndpoint, USB_HW *ptrUSB_HW)
{
    extern void fnChangeUSBState(int iNewState, int iController);
    switch (iType) {
    case USB_SIM_RESET:
        {
            int x;
            fnChangeUSBState(0, 0);
            for (x = 0; x < NUMBER_OF_USB_ENDPOINTS; x++) {
                fnLogUSB(x, 0, 0, (unsigned char *)0xffffffff, 0);       // log reset on each endpoint
                if ( x != 0) {
                    ptrDPRAM_area[x] = 0;                                // clear the DPRAM allocations to all endpoints apart from control endpoint 0
                    usSizeEndpoint[x] = 0;
                    iAllocated[x] = 0;
                }
            }
        }
        break;
    case USB_SIM_TX:                                                     // a frame transmission has just been started
//      if (((TXPKTRDY | EPEDS) & *ptrUSB_HW->ptr_ulUSB_BDControl) != (TXPKTRDY | EPEDS)) { // if the ownership has not been passed to the USB controller ignore it
//          return;
//      }
        iInts |= USB_INT;                                                // flag that the interrupt should be handled
        ulEndpointInt |= (1 << iEndpoint);                               // flag endpoint
        break;
    case USB_SIM_ENUMERATED:                                             // flag that we have completed emumeration
        fnChangeUSBState(1, 0);
        break;
    case USB_SIM_STALL:
        fnLogUSB(iEndpoint, 0, 1, (unsigned char *)0xffffffff, 0);       // log stall
        break;
    case USB_SIM_SUSPEND:
        fnChangeUSBState(0, 0);
        break;
    }
}

extern void fnCheckUSBOut(int iChannel, int iDevice, int iEndpoint)
{
    /*
    extern int iGetGetBank(int iEndpoint);

    int iBank = 0;
    */
    switch (iEndpoint) {
    case 0:                                                              // endpoint 0
      //if (!(UDP_CSR0 & EPEDS)) {
      //    return;                                                      // endpoint not enabled so ignore
      //}
        while ((UESTA0 & TXINE) == 0) {                                  // transmission bit clear
            unsigned short usUSBLength = (unsigned short)((UESTA0 & BYCT_MASK) >> BYCT_SHIFT); // the transmission length
            iTxDataToggle[0] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(0, 0, usUSBLength, ptrDPRAM_area[0], iTxDataToggle[0]);
            UESTA0 |= TXINE;                                             // transmission complete and acknowledged
            if ((UDINTE & UDINT_EP0) && (UECON0 & TXINE)) {              // if endpoint interrupt and interrupt on tx completion enabled
                UDINT |= UDINT_EP0;                                      // set endpoint interrupt (acknowledged)
                fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS); // generate tx interrupt
            }
        }
        if (UECON0SET & STALLRQ) {                                       // if a stall has been requested
            UECON0 |= STALLRQ;
            UECON0SET &= ~STALLRQ;
          //UDP_CSR0 |= STALLSENT;                                       // stall acknowledged
          //UDP_ISR = EP0INT;
          //fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
        /*
    case 1:                                                              // endpoint 1
        if (!(UDP_CSR1 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR1 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(1);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut1[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[1] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(1, 0, usUSBLength, &ucEndpointFifoOut1[iBank][2], iTxDataToggle[1]);
            if (UDP_IMR & EP1INT) {
                UDP_ISR |= EP1INT;
            }
            UDP_CSR1 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR1 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);  // generate tx interrupt
        }
        if (UDP_CSR1 & FORCESTALL) {
            UDP_CSR1 |= STALLSENT;                                       // stall acknowledged
            UDP_ISR = EP1INT;
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
    case 2:                                                              // endpoint 2
        if (!(UDP_CSR2 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR2 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(2);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut2[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[2] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(2, 0, usUSBLength, &ucEndpointFifoOut2[iBank][2], iTxDataToggle[2]);
            if (UDP_IMR & EP2INT) {
                UDP_ISR |= EP2INT;
            }
            UDP_CSR2 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR2 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);  // generate tx interrupt
        }
        if (UDP_CSR2 & FORCESTALL) {
            UDP_CSR2 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP2INT;
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
    case 3:                                                              // endpoint 3
        if (!(UDP_CSR3 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR3 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut3, sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[3] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(3, 0, usUSBLength, &ucEndpointFifoOut3[2], iTxDataToggle[3]);
            if (UDP_IMR & EP3INT) {
                UDP_ISR |= EP3INT;
            }
            UDP_CSR3 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR3 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);  // generate tx interrupt
        }
        if (UDP_CSR3 & FORCESTALL) {
            UDP_CSR3 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
    case 4:                                                              // endpoint 4
        if (!(UDP_CSR4 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR4 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(4);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut4[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[4] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(4, 0, usUSBLength, &ucEndpointFifoOut4[iBank][2], iTxDataToggle[4]);
            if (UDP_IMR & EP4INT) {
                UDP_ISR |= EP4INT;
            }
            UDP_CSR4 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR4 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);  // generate tx interrupt
        }
        if (UDP_CSR4 & FORCESTALL) {
            UDP_CSR4 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
    case 5:                                                              // endpoint 5
        if (!(UDP_CSR5 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR5 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(5);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut5[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[5] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(5, 0, usUSBLength, &ucEndpointFifoOut5[iBank][2], iTxDataToggle[5]);
            if (UDP_IMR & EP5INT) {
                UDP_ISR |= EP5INT;
            }
            UDP_CSR5 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR5 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);  // generate tx interrupt
        }
        if (UDP_CSR5 & FORCESTALL) {
            UDP_CSR5 |= STALLSENT;                                       // stall acknowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(0, iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS); // generate stall interrupt
        }
        break;
        */
    }
}
#endif

#ifndef SUPPORT_PORT_INTERRUPTS
    extern void _PortB_Interrupt(void);
#endif









// A copy of the AVR32 peripheral registers for simulation purposes
//
extern AVR32_PERIPH  ucAVR32 = {0};
extern AVR32_SYSTEM_REGISTERS ulAVR32_CPU = {0};

