sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
#ifdef _AT32UC3C
    extern unsigned long AVR32_ExceptionRAM[65 + 54] = {0};
#else
    extern unsigned long AVR32_ExceptionRAM[65] = {0};
#endif



// Initialisation fo all non-zero registers in the device
//
static void fnSetDevice(unsigned long *ulPortInits)
{
    extern void fnEnterHW_table(void *hw_table);

    ulAVR32_CPU.SR = (GM | EM | MODE1);

    PM_RCAUSE = PM_RCAUSE_POR;                                           // {9}

    PVR_0 = port0_in = *ulPortInits++;
    PVR_1 = port1_in = *ulPortInits++;
#ifndef _AT32UC3B                                                        // {1} UC3B has only ports A and B
    PVR_2 = port2_in = *ulPortInits++;
    PVR_3 = port3_in = *ulPortInits++;
#endif
#ifdef _AT32UC3C                                                         // {6}
    PM_CPUMASK = 0x00000003;
    PM_HSBMASK = 0x00003fff;
    PM_PBAMASK = 0x07ffffff;
    PM_PBBMASK = 0x0000007f;
    PM_PBCMASK = 0x000003ff;
#else
    PM_CPUMASK = 0x00000003;
    PM_HSBMASK = (HSBMASK_FLASHC | HSBMASK_PBA_BRIDGE | HSBMASK_PBB_BRIDGE | HSBMASK_USBB | HSBMASK_MACB | HSBMASK_PDCA | HSBMASK_EBI); // powered up by default
    PM_PBAMASK = (PBAMASK_INTC | PBAMASK_GPIO | PBAMASK_PDCA | PBAMASK_RM_RTC_EIC | PBAMASK_ADC | PBAMASK_SPI0 | \
                  PBAMASK_SPI1 | PBAMASK_TWI | PBAMASK_USART0 | PBAMASK_USART1 | PBAMASK_USART2 | PBAMASK_USART3 | \
                  PBAMASK_PWM | PBAMASK_SSC | PBAMASK_TC | PBAMASK_ABDAC); // powered up by default
    PM_PBBMASK = (PM_PBBMASK | PBBMASK_HMATRIX | PBBMASK_USBB | PBBMASK_FLASHC | PBBMASK_MACB | PBBMASK_SMC | PBBMASK_SDRAMC); // powered up by default
#endif

    GPER_0     = 0xffffffff;                                             // all GPIO enabled by default
    GPER_1     = 0xffffffff;
    GPER_2     = 0xffffffff;
    GPER_3     = 0xffffffff;

    WDT_CLR    = 0x55aa;                                                 // mark that the watchdog hasn't been retriggered

    MACB_NCFGR = MCLK_32;                                                // MACB
    MACB_IMR   = 0x00003fff;
    MACB_TPQ   = 0x0000ffff;

    HSB_MCFG0  = 0x00000002;                                             // HSB matrix
    HSB_MCFG1  = 0x00000002;
    HSB_MCFG2  = 0x00000002;
    HSB_MCFG3  = 0x00000002;
    HSB_MCFG4  = 0x00000002;
    HSB_MCFG5  = 0x00000002;
    HSB_MCFG6  = 0x00000002;
    HSB_MCFG7  = 0x00000002;
    HSB_MCFG8  = 0x00000002;
    HSB_MCFG9  = 0x00000002;
    HSB_MCFG10 = 0x00000002;
    HSB_MCFG11 = 0x00000002;
    HSB_MCFG12 = 0x00000002;
    HSB_MCFG13 = 0x00000002;
    HSB_MCFG14 = 0x00000002;
    HSB_MCFG15 = 0x00000002;
    HSB_SCFG0  = 0x00000010;
    HSB_SCFG1  = 0x00000010;
    HSB_SCFG2  = 0x00000010;
    HSB_SCFG3  = 0x00000010;
    HSB_SCFG4  = 0x00000010;
    HSB_SCFG5  = 0x00000010;
    HSB_SCFG6  = 0x00000010;
    HSB_SCFG7  = 0x00000010;
    HSB_SCFG8  = 0x00000010;
    HSB_SCFG9  = 0x00000010;
    HSB_SCFG10 = 0x00000010;
    HSB_SCFG11 = 0x00000010;
    HSB_SCFG12 = 0x00000010;
    HSB_SCFG13 = 0x00000010;
    HSB_SCFG14 = 0x00000010;
    HSB_SCFG15 = 0x00000010;

    TWI_SR = 0x0008;

    US_CSR_0 = CTS_HIGH;                                                 // default input is high
    US_CSR_1 = CTS_HIGH;
    US_CSR_2 = CTS_HIGH;
    US_CSR_3 = CTS_HIGH;

    ADC_SR    = (ADC_ENDRX | ADC_RXBUFF);

    SPI_SR_0  = 0x000000f0;
    SPI_SR_1  = 0x000000f0;

    USBCON = (USBCON_FRZCLK | USBCON_UIDE | USBCON_UIMOD);               // {3} USBB
    UDCON  = UDCON_DETACH;
    USBSTA = 0x00000400;
    UVERS = 0x00000310;
    UFEATURES = 0x00012467;
    UADDRSIZE = 0x00001000;
    UNAME1 = 0x48555342;                                                 // "HUSB"
    UNAME2 = 0x004f5447;                                                 // "\0OTG"
    USBFSM = 0x00000009;

    
    SDRAMC_CR = 0x852372c0;                                              // SDRAM controller

#ifdef SUPPORT_ADC
    memcpy(ulADC_values, ulPortInits, sizeof(ulADC_values));             // prime initial ADC values
    fnEnterHW_table(ptrPorts);                                           
#else
    fnEnterHW_table(ucPortFunctions);
#endif
}


extern void fnInitialiseDevice(void *port_inits)
{
    memset(ucFLASH, 0xff, sizeof(ucFLASH));                              // we start with deleted FLASH memory contents
    fnPrimeFileSystem();                                                 // the project can then set parameters or files as required
    fnSetDevice((unsigned long *)port_inits);                            // set device registers to startup condition (if not zerod)
}

#ifdef _AT32UC3C                                                         // {6}
#define PERIPHERAL_A_FUNCTION 1
#define PERIPHERAL_B_FUNCTION 2
#define PERIPHERAL_C_FUNCTION 3
#define PERIPHERAL_D_FUNCTION 4
#define PERIPHERAL_E_FUNCTION 5
#define PERIPHERAL_F_FUNCTION 6
#define PERIPHERAL_G_FUNCTION 7
#define PERIPHERAL_H_FUNCTION 8

static void fnUpdataPeripheralFunctions(int iPort, unsigned long ulMux0, unsigned long ulMux1, unsigned long ulMux2, unsigned long ulGPIO)
{
    unsigned long ulBit = 0x00000001;
    int i = 0;
    while (i < PORT_WIDTH) {
        if (ulGPIO & ulBit) {
            ucPortFunctions[iPort][i] = 0;                               // GPIO
        }
        else {
            if (ulMux0 & ulBit) {
                ucPortFunctions[iPort][i] = PERIPHERAL_B_FUNCTION;       // B
            }
            else {
                ucPortFunctions[iPort][i] = PERIPHERAL_A_FUNCTION;       // A
            }
            if (ulMux1 & ulBit) {
                ucPortFunctions[iPort][i] += PERIPHERAL_B_FUNCTION;      // C or D
            }
            if (ulMux2 & ulBit) {
                ucPortFunctions[iPort][i] += PERIPHERAL_D_FUNCTION;      // E to H
                if (ucPortFunctions[iPort][i] == PERIPHERAL_H_FUNCTION) {// there is no peripheral H function on thsi device so it is signalling the special oscillator mode
                    ucPortFunctions[iPort][i]++;                         // move to the oscillator mode display
                }
            }
        }
        i++;
        ulBit <<= 1;
    }
}
#else
static void fnUpdataPeripheralFunctions(int iPort, unsigned long ulMux0, unsigned long ulMux1, unsigned long ulGPIO)
{
    unsigned long ulBit = 0x00000001;
    int i = 0;
    while (i < PORT_WIDTH) {
        if (ulGPIO & ulBit) {
            ucPortFunctions[iPort][i] = 0;                               // GPIO
        }
        else {
            if (ulMux0 & ulBit) {
                ucPortFunctions[iPort][i] = 2;                           // B
            }
            else {
                ucPortFunctions[iPort][i] = 1;                           // A
            }
            if (ulMux1 & ulBit) {
                ucPortFunctions[iPort][i] += 2;                          // C or D
            }
        }
        i++;
        ulBit <<= 1;
    }
}
#endif

extern void fnSimPortsAVR(int iPort)
{ 
    static unsigned long ulADC = 0x00000000;
    static unsigned long LastPeripheral0[4] = {0};
    static unsigned long LastPeripheral1[4] = {0};
#ifdef _AT32UC3C                                                         // {6}
    static unsigned long LastPeripheral2[4] = {0};
#endif
    static unsigned long LastGPER[4] = {0xffffffff, 0xffffffff, 0xffffffff, 0xffffffff};
    int iPeripheralChange = 0;
    switch (iPort) {
    case 0:
        GPER_0 ^= GPERT_0;                                               // toggle enable bits
        GPER_0 |= GPERS_0;                                               // set enable bits
        GPER_0 &= ~GPERC_0;                                              // clear enable bits
        GPERT_0 = GPERS_0 = GPERC_0 = 0;                                 // reset write only registers

        PMR0_0 ^= PMR0T_0;                                               // toggle mux0 bits
        PMR0_0 |= PMR0S_0;                                               // set mux0 bits
        PMR0_0 &= ~PMR0C_0;                                              // clear mux0 bits
        PMR0T_0 = PMR0S_0 = PMR0C_0 = 0;                                 // reset write only registers

        PMR1_0 ^= PMR1T_0;                                               // toggle mux1 bits
        PMR1_0 |= PMR1S_0;                                               // set mux1 bits
        PMR1_0 &= ~PMR1C_0;                                              // clear mux1 bits
        PMR1T_0 = PMR1S_0 = PMR1C_0 = 0;                                 // reset write only registers

