sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
    #if defined _AT32UC3C                                                // {6}
        PMR2_0 ^= PMR2T_0;                                               // toggle mux1 bits
        PMR2_0 |= PMR2S_0;                                               // set mux1 bits
        PMR2_0 &= ~PMR2C_0;                                              // clear mux1 bits
        PMR2T_0 = PMR2S_0 = PMR2C_0 = 0;                                 // reset write only registers
    #endif

        ODER_0 ^= ODERT_0;                                               // toggle driver bits
        ODER_0 |= ODERS_0;                                               // set driver bits
        ODER_0 &= ~ODERC_0;                                              // clear driver bits
        ODERT_0 = ODERS_0 = ODERC_0 = 0;                                 // reset write only registers

        PUER_0 ^= PUERT_0;                                               // toggle pull-up bits
        PUER_0 |= PUERS_0;                                               // set pull-up bits
        PUER_0 &= ~PUERC_0;                                              // clear pull-up bits
        PUERT_0 = PUERS_0 = PUERC_0 = 0;                                 // reset write only registers
    #if !defined _AT32UC3C                                               // {12}
        ODMER_0 ^= ODMERT_0;                                             // toggle open drain bits
        ODMER_0 |= ODMERS_0;                                             // set open drain bits
        ODMER_0 &= ~ODMERC_0;                                            // clear open drain bits
        ODMERT_0 = ODMERS_0 = ODMERC_0 = 0;                              // reset write only registers
    #endif
        GFER_0 ^= GFERT_0;                                               // toggle glitch filter bits
        GFER_0 |= GFERS_0;                                               // set glitch filter bits
        GFER_0 &= ~GFERC_0;                                              // clear glitch filter bits
        GFERT_0 = GFERS_0 = GFERC_0 = 0;                                 // reset write only registers

        OVR_0 ^= OVRT_0;                                                 // toggle port bits
        OVR_0 |= OVRS_0;                                                 // set port bits
        OVR_0 &= ~OVRC_0;                                                // clear port bits
        OVRT_0 = OVRS_0 = OVRC_0 = 0;                                    // reset write only registers

        PVR_0 = (ODER_0 & OVR_0);                                        // output driven values
        PVR_0 |= (~ODER_0 & port0_in);                                   // complete pin state after adding inputs
        if (LastPeripheral0[0] != PMR0_0) {
            LastPeripheral0[0] = PMR0_0;
            iPeripheralChange = 1;
        }
        if (LastPeripheral1[0] != PMR1_0) {
            LastPeripheral1[0] = PMR1_0;
            iPeripheralChange = 1;
        }
    #ifdef _AT32UC3C                                                     // {6}
        if (LastPeripheral2[0] != PMR2_0) {
            LastPeripheral2[0] = PMR2_0;
            iPeripheralChange = 1;
        }
    #endif
        if (LastGPER[0] != GPER_0) {
            LastGPER[0] = GPER_0;
            iPeripheralChange = 1;
        }
        iFlagRefresh = PORT_CHANGE;                                      // ensure port display is updated
        if ((iPeripheralChange != 0) || (ulADC != ADC_CHSR)) {
            int i = 21;
            ulADC = ADC_CHSR;
#if defined _AT32UC3B
            fnUpdataPeripheralFunctions(0, (PMR0_0 | ulOscillator), (PMR1_0 | ulOscillator), (GPER_0 & ~ulOscillator));
#elif defined _AT32UC3C                                                  // {6}
            fnUpdataPeripheralFunctions(0, PMR0_0, PMR1_0, PMR2_0, GPER_0);
#else
            fnUpdataPeripheralFunctions(0, PMR0_0, PMR1_0, GPER_0);
#endif
            while (i < 29) {                                             // all possible ADC inputs
                if (ADC_CHSR & (0x01 << (i - 21))) {                     // ADC function set
                    ucPortFunctions[0][i] = 1;                           // force ADC peripheral mode
                }
                i++;
            }
        }
        break;
#if PORTS_AVAILABLE > 1
    case 1:
        GPER_1 ^= GPERT_1;                                               // toggle enable bits
        GPER_1 |= GPERS_1;                                               // set enable bits
        GPER_1 &= ~GPERC_1;                                              // clear enable bits
        GPERT_1 = GPERS_1 = GPERC_1 = 0;                                 // reset write only registers

        PMR0_1 ^= PMR0T_1;                                               // toggle mux0 bits
        PMR0_1 |= PMR0S_1;                                               // set mux0 bits
        PMR0_1 &= ~PMR0C_1;                                              // clear mux0 bits
        PMR0T_1 = PMR0S_1 = PMR0C_1 = 0;                                 // reset write only registers

        PMR1_1 ^= PMR1T_1;                                               // toggle mux1 bits
        PMR1_1 |= PMR1S_1;                                               // set mux1 bits
        PMR1_1 &= ~PMR1C_1;                                              // clear mux1 bits
        PMR1T_1 = PMR1S_1 = PMR1C_1 = 0;                                 // reset write only registers

    #ifdef _AT32UC3C                                                     // {6}
        PMR2_1 ^= PMR2T_1;                                               // toggle mux1 bits
        PMR2_1 |= PMR2S_1;                                               // set mux1 bits
        PMR2_1 &= ~PMR2C_1;                                              // clear mux1 bits
        PMR2T_1 = PMR2S_1 = PMR2C_1 = 0;                                 // reset write only registers
    #endif

        ODER_1 ^= ODERT_1;                                               // toggle driver bits
        ODER_1 |= ODERS_1;                                               // set driver bits
        ODER_1 &= ~ODERC_1;                                              // clear driver bits
        ODERT_1 = ODERS_1 = ODERC_1 = 0;                                 // reset write only registers

        PUER_1 ^= PUERT_1;                                               // toggle pull-up bits
        PUER_1 |= PUERS_1;                                               // set pull-up bits
        PUER_1 &= ~PUERC_1;                                              // clear pull-up bits
        PUERT_1 = PUERS_1 = PUERC_1 = 0;                                 // reset write only registers
    #if !defined _AT32UC3C                                               // {12}
        ODMER_1 ^= ODMERT_1;                                             // toggle open drain bits
        ODMER_1 |= ODMERS_1;                                             // set open drain bits
        ODMER_1 &= ~ODMERC_1;                                            // clear open drain bits
        ODMERT_1 = ODMERS_1 = ODMERC_1 = 0;                              // reset write only registers
    #endif
        GFER_1 ^= GFERT_1;                                               // toggle glitch filter bits
        GFER_1 |= GFERS_1;                                               // set glitch filter bits
        GFER_1 &= ~GFERC_1;                                              // clear glitch filter bits
        GFERT_1 = GFERS_1 = GFERC_1 = 0;                                 // reset write only registers

        OVR_1 ^= OVRT_1;                                                 // toggle port bits
        OVR_1 |= OVRS_1;                                                 // set port bits
        OVR_1 &= ~OVRC_1;                                                // clear port bits
        OVRT_1 = OVRS_1 = OVRC_1 = 0;                                    // reset write only registers

        PVR_1 = (ODER_1 & OVR_1);                                        // output driven values
        PVR_1 |= (~ODER_1 & port1_in);                                   // complete pin state after adding inputs

        if (LastPeripheral0[1] != PMR0_1) {
            LastPeripheral0[1] = PMR0_1;
            iPeripheralChange = 1;
        }
        if (LastPeripheral1[1] != PMR1_1) {
            LastPeripheral1[1] = PMR1_1;
            iPeripheralChange = 1;
        }
    #ifdef _AT32UC3C                                                     // {6}
        if (LastPeripheral2[1] != PMR2_1) {
            LastPeripheral2[1] = PMR2_1;
            iPeripheralChange = 1;
        }
    #endif
        if (LastGPER[1] != GPER_1) {
            LastGPER[1] = GPER_1;
            iPeripheralChange = 1;
        }
        iFlagRefresh = PORT_CHANGE;                                      // ensure port display is updated
        if (iPeripheralChange != 0) {
    #if defined _AT32UC3C                                                // {6}
            fnUpdataPeripheralFunctions(1, (PMR0_1 | ulOscillator), (PMR1_1 | ulOscillator), (PMR2_1 | ulOscillator), (GPER_1 & ~ulOscillator));
    #else
            fnUpdataPeripheralFunctions(1, PMR0_1, PMR1_1, GPER_1);
    #endif
        }
        break;
#endif
#if PORTS_AVAILABLE > 2
    case 2:
        GPER_2 ^= GPERT_2;                                               // toggle enable bits
        GPER_2 |= GPERS_2;                                               // set enable bits
        GPER_2 &= ~GPERC_2;                                              // clear enable bits
        GPERT_2 = GPERS_2 = GPERC_2 = 0;                                 // reset write only registers

        PMR0_2 ^= PMR0T_2;                                               // toggle mux0 bits
        PMR0_2 |= PMR0S_2;                                               // set mux0 bits
        PMR0_2 &= ~PMR0C_2;                                              // clear mux0 bits
        PMR0T_2 = PMR0S_2 = PMR0C_2 = 0;                                 // reset write only registers

        PMR1_2 ^= PMR1T_2;                                               // toggle mux1 bits
        PMR1_2 |= PMR1S_2;                                               // set mux1 bits
        PMR1_2 &= ~PMR1C_2;                                              // clear mux1 bits
        PMR1T_2 = PMR1S_2 = PMR1C_2 = 0;                                 // reset write only registers

    #ifdef _AT32UC3C                                                     // {6}
        PMR2_2 ^= PMR2T_2;                                               // toggle mux1 bits
        PMR2_2 |= PMR2S_2;                                               // set mux1 bits
        PMR2_2 &= ~PMR2C_2;                                              // clear mux1 bits
        PMR2T_2 = PMR2S_2 = PMR2C_2 = 0;                                 // reset write only registers
    #endif

