sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
        ODER_2 ^= ODERT_2;                                               // toggle driver bits
        ODER_2 |= ODERS_2;                                               // set driver bits
        ODER_2 &= ~ODERC_2;                                              // clear driver bits
        ODERT_2 = ODERS_2 = ODERC_2 = 0;                                 // reset write only registers

        PUER_2 ^= PUERT_2;                                               // toggle pull-up bits
        PUER_2 |= PUERS_2;                                               // set pull-up bits
        PUER_2 &= ~PUERC_2;                                              // clear pull-up bits
        PUERT_2 = PUERS_2 = PUERC_2 = 0;                                 // reset write only registers
    #if !defined _AT32UC3C                                               // {12}
        ODMER_2 ^= ODMERT_2;                                             // toggle open drain bits
        ODMER_2 |= ODMERS_2;                                             // set open drain bits
        ODMER_2 &= ~ODMERC_2;                                            // clear open drain bits
        ODMERT_2 = ODMERS_2 = ODMERC_2 = 0;                              // reset write only registers
    #endif
        GFER_2 ^= GFERT_2;                                               // toggle glitch filter bits
        GFER_2 |= GFERS_2;                                               // set glitch filter bits
        GFER_2 &= ~GFERC_2;                                              // clear glitch filter bits
        GFERT_2 = GFERS_2 = GFERC_2 = 0;                                 // reset write only registers

        OVR_2 ^= OVRT_2;                                                 // toggle port bits
        OVR_2 |= OVRS_2;                                                 // set port bits
        OVR_2 &= ~OVRC_2;                                                // clear port bits
        OVRT_2 = OVRS_2 = OVRC_2 = 0;                                    // reset write only registers

        PVR_2 = (ODER_2 & OVR_2);                                        // output driven values
        PVR_2 |= (~ODER_2 & port2_in);                                   // complete pin state after adding inputs

        if (LastPeripheral0[2] != PMR0_2) {
            LastPeripheral0[2] = PMR0_2;
            iPeripheralChange = 1;
        }
        if (LastPeripheral1[2] != PMR1_2) {
            LastPeripheral1[2] = PMR1_2;
            iPeripheralChange = 1;
        }
    #ifdef _AT32UC3C                                                     // {6}
        if (LastPeripheral2[2] != PMR2_2) {
            LastPeripheral2[2] = PMR2_2;
            iPeripheralChange = 1;
        }
    #endif
        if (LastGPER[2] != GPER_2) {
            LastGPER[2] = GPER_2;
            iPeripheralChange = 1;
        }
        iFlagRefresh = PORT_CHANGE;                                      // ensure port display is updated
        if (iPeripheralChange != 0) {
    #if defined _AT32UC3C                                                // {6}
            fnUpdataPeripheralFunctions(2, PMR0_2, PMR1_2, PMR2_2, GPER_2);
    #elif defined _AT32UC3B
            fnUpdataPeripheralFunctions(2, PMR0_2, PMR1_2, GPER_2);
    #else
            fnUpdataPeripheralFunctions(2, (PMR0_2 | ulOscillator), (PMR1_2 | ulOscillator), (GPER_2 & ~ulOscillator));
    #endif
        }
        break;
#endif
#if PORTS_AVAILABLE > 3
    case 3:
        GPER_3 ^= GPERT_3;                                               // toggle enable bits
        GPER_3 |= GPERS_3;                                               // set enable bits
        GPER_3 &= ~GPERC_3;                                              // clear enable bits
        GPERT_3 = GPERS_3 = GPERC_3 = 0;                                 // reset write only registers

        PMR0_3 ^= PMR0T_3;                                               // toggle mux0 bits
        PMR0_3 |= PMR0S_3;                                               // set mux0 bits
        PMR0_3 &= ~PMR0C_3;                                              // clear mux0 bits
        PMR0T_3 = PMR0S_3 = PMR0C_3 = 0;                                 // reset write only registers

        PMR1_3 ^= PMR1T_3;                                               // toggle mux1 bits
        PMR1_3 |= PMR1S_3;                                               // set mux1 bits
        PMR1_3 &= ~PMR1C_3;                                              // clear mux1 bits
        PMR1T_3 = PMR1S_3 = PMR1C_3 = 0;                                 // reset write only registers

    #ifdef _AT32UC3C                                                     // {6}
        PMR2_3 ^= PMR2T_3;                                               // toggle mux2 bits
        PMR2_3 |= PMR2S_3;                                               // set mux2 bits
        PMR2_3 &= ~PMR2C_3;                                              // clear mux1 bits
        PMR2T_3 = PMR2S_3 = PMR2C_3 = 0;                                 // reset write only registers
    #endif

        ODER_3 ^= ODERT_3;                                               // toggle driver bits
        ODER_3 |= ODERS_3;                                               // set driver bits
        ODER_3 &= ~ODERC_3;                                              // clear driver bits
        ODERT_3 = ODERS_3 = ODERC_3 = 0;                                 // reset write only registers

        PUER_3 ^= PUERT_3;                                               // toggle pull-up bits
        PUER_3 |= PUERS_3;                                               // set pull-up bits
        PUER_3 &= ~PUERC_3;                                              // clear pull-up bits
        PUERT_3 = PUERS_3 = PUERC_3 = 0;                                 // reset write only registers
    #if !defined _AT32UC3C                                               // {12}
        ODMER_3 ^= ODMERT_3;                                             // toggle open drain bits
        ODMER_3 |= ODMERS_3;                                             // set open drain bits
        ODMER_3 &= ~ODMERC_3;                                            // clear open drain bits
        ODMERT_3 = ODMERS_3 = ODMERC_3 = 0;                              // reset write only registers
    #endif
        GFER_3 ^= GFERT_3;                                               // toggle glitch filter bits
        GFER_3 |= GFERS_3;                                               // set glitch filter bits
        GFER_3 &= ~GFERC_3;                                              // clear glitch filter bits
        GFERT_3 = GFERS_3 = GFERC_3 = 0;                                 // reset write only registers

        OVR_3 ^= OVRT_3;                                                 // toggle port bits
        OVR_3 |= OVRS_3;                                                 // set port bits
        OVR_3 &= ~OVRC_3;                                                // clear port bits
        OVRT_3 = OVRS_3 = OVRC_3 = 0;                                    // reset write only registers

        PVR_3 = (ODER_3 & OVR_3);                                        // output driven values
        PVR_3 |= (~ODER_3 & port3_in);                                   // complete pin state after adding inputs

        if (LastPeripheral0[3] != PMR0_3) {
            LastPeripheral0[3] = PMR0_3;
            iPeripheralChange = 1;
        }
        if (LastPeripheral1[3] != PMR1_3) {
            LastPeripheral1[3] = PMR1_3;
            iPeripheralChange = 1;
        }
    #ifdef _AT32UC3C                                                     // {6}
        if (LastPeripheral2[3] != PMR2_3) {
            LastPeripheral2[3] = PMR2_3;
            iPeripheralChange = 1;
        }
    #endif
        if (LastGPER[3] != GPER_3) {
            LastGPER[3] = GPER_3;
            iPeripheralChange = 1;
        }
        iFlagRefresh = PORT_CHANGE;                                      // ensure port display is updated
        if (iPeripheralChange != 0) {
    #if defined _AT32UC3C                                                // {6}
            fnUpdataPeripheralFunctions(3, PMR0_3, PMR1_3, PMR2_3, GPER_3);
    #else
            fnUpdataPeripheralFunctions(3, PMR0_3, PMR1_3, GPER_3);
    #endif
        }
        break;
#endif
    default:                                                             // {2} special case after change of oscillator pins
#ifdef _AT32UC3C
        if (SCIF_OSCCTRL0 & SCIF_OSCCTRL_MODE_CRYSTAL) {
            ulOscillator |= (PIN_XIN0 | PIN_XOUT0);
        }
        else {
            ulOscillator &= ~(PIN_XIN0 | PIN_XOUT0);
        }
        if (SCIF_OSCCTRL1 & SCIF_OSCCTRL_MODE_CRYSTAL) {
            ulOscillator |= (PIN_XIN1 | PIN_XOUT1);
        }
        else {
            ulOscillator &= ~(PIN_XIN1 | PIN_XOUT1);
        }
#else
        if (PM_OSCCTRL0 & 0x07) {                                        // oscillator 0 is enabled
            ulOscillator |= (PIN_XIN0 | PIN_XOUT0);
        }
        else {
            ulOscillator &= ~(PIN_XIN0 | PIN_XOUT0);
        }
    #if !defined _AT32UC3B || !defined CHIP_48_PIN                       // oscillator 1 not available on smaller AT32UC3B parts
        if (PM_OSCCTRL1 & 0x07) {                                        // oscillator 1 is enabled
            ulOscillator |= (PIN_XIN1 | PIN_XOUT1);
        }
        else {
            ulOscillator &= ~(PIN_XIN1 | PIN_XOUT1);
        }
    #endif
        if (PM_OSCCTRL32 & 0x00000700) {                                 // oscillator 32 is enabled
            ulOscillator |= (PIN_XIN32 | PIN_XOUT32);
        }
        else {
            ulOscillator &= ~(PIN_XIN32 | PIN_XOUT32);
        }
#endif
#if defined _AT32UC3B
        iPort = 0;                                                       // clocks are all on port 0
        fnUpdataPeripheralFunctions(iPort, ulOscillator, ulOscillator, ~ulOscillator);
#elif defined _AT32UC3C
        iPort = 1;                                                       // clocks are all on port 1
        fnUpdataPeripheralFunctions(iPort, ulOscillator, ulOscillator, ulOscillator, ~ulOscillator);
#else
        iPort = 2;                                                       // clocks are all on port 2
        fnUpdataPeripheralFunctions(iPort, ulOscillator, ulOscillator, ~ulOscillator);
#endif
        iFlagRefresh = PORT_CHANGE;
        break;
    }
}

