sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
#if defined _AT32UC3C                                                    // {8}
static unsigned long fnGetExtIntPin(unsigned char ucPort, int iInterrupt)
{
    switch (ucPort) {
    case 0:                                                              // external interrupts on port A
        switch (iInterrupt) {                                            // the interrupt number
        case 0:
            if (ucPortFunctions[ucPort][25] == PERIPHERAL_C_FUNCTION) {  // PA25-C function
                return PA25;
            }
            if (ucPortFunctions[ucPort][29] == PERIPHERAL_B_FUNCTION) {  // PA29-B function
                return PA29;
            }
            break;
        case 1:
            if (ucPortFunctions[ucPort][3] == PERIPHERAL_B_FUNCTION) {   // PA03-B function
                return PA03;
            }
            if (ucPortFunctions[ucPort][19] == PERIPHERAL_B_FUNCTION) {  // PA19-B function
                return PA19;
            }
            if (ucPortFunctions[ucPort][26] == PERIPHERAL_B_FUNCTION) {  // PA26-B function
                return PA26;
            }
            break;
        case 2:
            if (ucPortFunctions[ucPort][8] == PERIPHERAL_C_FUNCTION) {   // PA08-C function
                return PA08;
            }
            if (ucPortFunctions[ucPort][27] == PERIPHERAL_B_FUNCTION) {  // PA27-B function
                return PA27;
            }
            break;
        case 3:
            if (ucPortFunctions[ucPort][28] == PERIPHERAL_B_FUNCTION) {  // PA28-B function
                return PA28;
            }
            break;
        case 4:
            if (ucPortFunctions[ucPort][10] == PERIPHERAL_B_FUNCTION) {  // PA10-B function
                return PA10;
            }
            break;
        }
        break;

    case 1:                                                              // external interrupts on port B
        switch (iInterrupt) {                                            // the interrupt number
        case 2:
            if (ucPortFunctions[ucPort][7] == PERIPHERAL_D_FUNCTION) {   // PB07-B function
                return PB07;
            }
            break;
        case 4:
            if (ucPortFunctions[ucPort][18] == PERIPHERAL_C_FUNCTION) {  // PB18-C function
                return PB18;
            }
            break;
        case 8:
            if (ucPortFunctions[ucPort][0] == PERIPHERAL_C_FUNCTION) {   // PB00-C function
                return PB00;
            }
            break;
        }
        break;

    case 2:                                                              // external interrupts on port C
        switch (iInterrupt) {                                            // the interrupt number
        case 0:
            if (ucPortFunctions[ucPort][27] == PERIPHERAL_D_FUNCTION) {  // PC27-D function
                return PC27;
            }
            break;
        case 1:
            if (ucPortFunctions[ucPort][3] == PERIPHERAL_B_FUNCTION) {   // PC03-B function
                return PC03;
            }
            break;
        case 3:
            if (ucPortFunctions[ucPort][4] == PERIPHERAL_B_FUNCTION) {   // PC04-B function
                return PC04;
            }
            break;
        case 4:
            if (ucPortFunctions[ucPort][5] == PERIPHERAL_B_FUNCTION) {   // PC05-B function
                return PC05;
            }
            break;
        case 5:
            if (ucPortFunctions[ucPort][18] == PERIPHERAL_B_FUNCTION) {  // PC18-B function
                return PC18;
            }
            break;
        case 7:
            if (ucPortFunctions[ucPort][13] == PERIPHERAL_B_FUNCTION) {  // PC13-B function
                return PC13;
            }
            break;
        }
        break;

    case 3:                                                              // external interrupts on port D
        switch (iInterrupt) {                                            // the interrupt number
        case 0:
            if (ucPortFunctions[ucPort][21] == PERIPHERAL_B_FUNCTION) {  // PD21-B function
                return PD21;
            }
            break;
        case 3:
            if (ucPortFunctions[ucPort][30] == PERIPHERAL_B_FUNCTION) {  // PD30-B function
                return PD30;
            }
            break;
        case 5:
            if (ucPortFunctions[ucPort][7] == PERIPHERAL_B_FUNCTION) {   // PD07-B function
                return PD07;
            }
            break;
        case 6:
            if (ucPortFunctions[ucPort][8] == PERIPHERAL_B_FUNCTION) {   // PD08-B function
                return PD08;
            }
            if (ucPortFunctions[ucPort][29] == PERIPHERAL_B_FUNCTION) {  // PD29-B function
                return PD29;
            }
            break;
        case 7:
            if (ucPortFunctions[ucPort][14] == PERIPHERAL_B_FUNCTION) {  // PD14-B function
                return PD14;
            }
            break;
        case 8:
            if (ucPortFunctions[ucPort][24] == PERIPHERAL_B_FUNCTION) {  // PB24-B function
                return PB24;
            }
            break;
        }
        break;
    }
    return 0;                                                            // no pins on this port are configured for external interrupt
}

static void fnHandleUC3C_EIC(unsigned char ucPort, unsigned long ulBit, unsigned long port_in)
{
    unsigned long ext_int_port_bit;
    int iNMI = 0;

    ext_int_port_bit = fnGetExtIntPin(ucPort, 0);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_0) && (ext_int_port_bit & ulBit)) {          // if external interrupt 0 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_0)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_0) && (!(ext_int_port_bit & port_in))) { // rising edge
                iNMI = 1;
            }
            else if ((!(EIC_EDGE & EXT_INT_0)) && (ext_int_port_bit & port_in)) { // falling edge
                iNMI = 1;
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 1);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_1) && (ext_int_port_bit & ulBit)) {          // if external interrupt 1 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_1)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_1) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_1 << 1);
            }
            else if ((!(EIC_EDGE & EXT_INT_1)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_1 << 1);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 2);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_2) && (ext_int_port_bit & ulBit)) {          // if external interrupt 2 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_2)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_2) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_2 << 1);
            }
            else if ((!(EIC_EDGE & EXT_INT_2)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_2 << 1);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 3);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_3) && (ext_int_port_bit & ulBit)) {          // if external interrupt 3 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_3)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_3) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_3 << 1);
            }
            else if ((!(EIC_EDGE & EXT_INT_3)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_3 << 1);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 4);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_4) && (ext_int_port_bit & ulBit)) {          // if external interrupt 4 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_4)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_4) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_4 << 1);
            }
            else if ((!(EIC_EDGE & EXT_INT_4)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR15 |= (IR_EXTERNAL_INT_CONTROLLER_4 << 1);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 5);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_5) && (ext_int_port_bit & ulBit)) {          // if external interrupt 5 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_5)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_5) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_5 << 5);
            }
            else if ((!(EIC_EDGE & EXT_INT_5)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_5 << 5);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 6);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_6) && (ext_int_port_bit & ulBit)) {          // if external interrupt 6 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_6)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_6) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_6 << 5);
            }
            else if ((!(EIC_EDGE & EXT_INT_6)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_6 << 5);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 7);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_7) && (ext_int_port_bit & ulBit)) {          // if external interrupt 7 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_7)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_7) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_7 << 5);
            }
            else if ((!(EIC_EDGE & EXT_INT_7)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_7 << 5);
            }
        }
        else {                                                           // level sensitive
        }
    }
    ext_int_port_bit = fnGetExtIntPin(ucPort, 8);                        // get the port bit that may be configured for this function
    if ((EIC_CTRL & EXT_INT_8) && (ext_int_port_bit & ulBit)) {          // if external interrupt 8 enabled and change on corresponding pin
        if (!(EIC_MODE & EXT_INT_8)) {                                   // edge triggered
            if ((EIC_EDGE & EXT_INT_8) && (!(ext_int_port_bit & port_in))) { // rising edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_8 << 5);
            }
            else if ((!(EIC_EDGE & EXT_INT_8)) && (ext_int_port_bit & port_in)) { // falling edge
                IRR16 |= (IR_EXTERNAL_INT_CONTROLLER_8 << 5);
            }
        }
        else {                                                           // level sensitive
        }
    }
    if (iNMI != 0) {                                                     // external interrupt 0 is NMI in UC3C
        void (*interrupt_call)(void);
        interrupt_call = (void *)AVR32_ExceptionRAM[0x10 + 1];
        interrupt_call();                                                // call external int handler
    }
    if (EIC_IMR & IRR15) {                                               // interrupt not masted
        if (!(ulAVR32_CPU.SR & GM)) {                                    // global interrupt not masked
            void (*interrupt_call)(void);
            interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR15 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
            interrupt_call();                                            // call external int handler
        }
    }
    if (EIC_IMR & IRR16) {                                               // interrupt not masted
        if (!(ulAVR32_CPU.SR & GM)) {                                    // global interrupt not masked
            void (*interrupt_call)(void);
            interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR16 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
            interrupt_call();                                            // call external int handler
        }
    }
}
        
#endif

