sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
extern void fnSimulateInputChange(unsigned char ucPort, unsigned char ucPortBit, int iChange)
{
    unsigned long ulBit = (0x00000001 << (31 - ucPortBit));
    if (!(PM_PBAMASK & PBAMASK_GPIO)) {                                  // check that power is powered
        return;
    }

    switch (ucPort) {
    case 0:                                                              // port 0
        if (ulBit & ODER_0) {
            break;                                                       // port is enabled as output
        }
        if (iChange & (TOGGLE_INPUT | TOGGLE_INPUT_NEG)) {               // if port is not enabled as output
#ifdef SUPPORT_ADC
            if (ADC_CHSR & (ulBit >> 21)) {                              // input is ADC so change the voltage
                int iAdc = 0;
                unsigned short usStepSize = ((ADC_SIM_STEP_SIZE) / ADC_REFERENCE_VOLTAGE);
                ulBit >>= 21;
                do {
                    iAdc++,
                    ulBit >>= 1;
                } while (ulBit);
                if (TOGGLE_INPUT_NEG & iChange) {
                    if (ulADC_values[iAdc-1] >= usStepSize) {
                        ulADC_values[iAdc-1] -= usStepSize;
                        fnSimADC(iAdc-1);
                    }
                }
                else {
                    if (ADC_MR & LOWRES) {
                        if ((ulADC_values[iAdc-1] + usStepSize) <= ADC_FULL_SCALE_8BIT) {
                            ulADC_values[iAdc-1] += usStepSize;
                            fnSimADC(iAdc-1);
                        }
                    }
                    else {
                        if ((ulADC_values[iAdc-1] + usStepSize) <= ADC_FULL_SCALE_10BIT) {
                            ulADC_values[iAdc-1] += usStepSize;
                            fnSimADC(iAdc-1);
                        }
                    }
                }
                break;
            }
#endif
            port0_in ^= ulBit;
            PVR_0 ^= ulBit;                                              // toggle the input state
        }
        else if (iChange == SET_INPUT) {                                 // {7}
            if (port0_in & ulBit) {
                break;                                                   // no change caused
            }
            port0_in |= ulBit;                                           // set the input high
            PVR_0 |= ulBit;
        }
        else  {
            if (!(port0_in & ulBit)) {
                break;                                                   // no change caused
            }
            port0_in &= ~ulBit;                                          // set the input low
            PVR_0 &= ~ulBit;
        }
        if (IER_0 & ulBit) {                                             // if change interrupt enabled
          //if (ulBit & (CTS_0 | CTS_1)) {
          //    fnModemChange(ulBit, ((porta_in & ulBit) == 0), 0);      // handle potential CTS changes
          //}
            if (((ulBit & IMR1_0) && (!(ulBit & port0_in))) ||           // falling edge
                ((!(ulBit & IMR1_0)) && (!((ulBit & IMR0_0)))) ||        // any edge
                ((ulBit & IMR0_0) && (ulBit & port0_in))) {              // rising edge
                IFR_0 |= ulBit;                                          // change detected
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_GPIO & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    if (ulBit & 0x000000ff) {
                        IRR_GPIO |= IR_GPIO_0;
                    }
                    else if (ulBit & 0x0000ff00) {
                        IRR_GPIO |= IR_GPIO_1;
                    }
                    else if (ulBit & 0x00ff0000) {
                        IRR_GPIO |= IR_GPIO_2;
                    }
                    else {
                        IRR_GPIO |= IR_GPIO_3;
                    }
                    interrupt_call();                                    // call GPIO change int handler
                }
            }
        }
#if defined _AT32UC3C                                                    // {8}
        fnHandleUC3C_EIC(ucPort, ulBit, port0_in);
#else
            if ((EIC_CTRL & EXT_INT_0) && (EIC_0_X & ulBit)) {           // if external interrupt 0 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_0)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_0) && (!(EIC_0_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_0;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_0)) && (EIC_0_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_0;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_1) && (EIC_1_X & ulBit)) {           // if external interrupt 1 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_1)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_1) && (!(EIC_1_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_1;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_1)) && (EIC_1_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_1;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_2) && (EIC_2_X & ulBit)) {           // if external interrupt 2 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_2)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_2) && (!(EIC_2_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_2;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_2)) && (EIC_2_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_2;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_3) && (EIC_3_X & ulBit)) {           // if external interrupt 3 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_3)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_3) && (!(EIC_3_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_3;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_3)) && (EIC_3_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_3;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_4) && (EIC_4_X & ulBit)) {           // if external interrupt 4 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_4)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_4) && (!(EIC_4_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_4;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_4)) && (EIC_4_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_4;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_5) && (EIC_5_X & ulBit)) {           // if external interrupt 5 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_5)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_5) && (!(EIC_5_X & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_5;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_5)) && (EIC_5_X & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_5;
                    }
                }
                else {                                                   // level sensitive
                }
            }
    #if !defined _AT32UC3B                                               // {1} AT32UC3B has INT0..5 on port A and the 64 pin version has INT6..7 on port B
            if ((EIC_CTRL & EXT_INT_6) && (EIC_6_B & ulBit)) {           // if external interrupt 6 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_6)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_6) && (!(EIC_6_B & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_6;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_6)) && (EIC_6_B & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_6;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_7) && (EIC_7_C & ulBit)) {           // if external interrupt 7 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_7)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_7) && (!(EIC_7_C & port0_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_7;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_7)) && (EIC_7_C & port0_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_7;
                    }
                }
                else {                                                   // level sensitive
                }
            }
    #endif
            if (EIC_IMR & IRR1) {                                        // interrupt not masted
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    interrupt_call();                                    // call external int handler
                }
            }
#endif
        break;
    case 1:                                                              // port 1
        if (ulBit & ODER_1) {
            break;                                                       // port is enabled as output
        }
        if (iChange & (TOGGLE_INPUT | TOGGLE_INPUT_NEG)) {               // if port is not enabled as output
            port1_in ^= ulBit;
            PVR_1 ^= ulBit;                                              // toggle the input state
        }
        else if (iChange == SET_INPUT) {                                 // {7}
            if (port1_in & ulBit) {
                break;                                                   // no change caused
            }
            port1_in |= ulBit;                                           // set the input high
            PVR_1 |= ulBit;
        }
        else  {
            if (!(port1_in & ulBit)) {
                break;                                                   // no change caused
            }
            port1_in &= ~ulBit;                                          // set the input low
            PVR_1 &= ~ulBit;
        }
        if (IER_1 & ulBit) {                                             // if change interrupt enabled
          //if (ulBit & (CTS_0 | CTS_1)) {
          //    fnModemChange(ulBit, ((porta_in & ulBit) == 0), 0);      // handle potential CTS changes
          //}
            if (((ulBit & IMR1_1) && (!(ulBit & port1_in))) ||           // falling edge
                ((!(ulBit & IMR1_1)) && (!((ulBit & IMR0_1)))) ||        // any edge
                ((ulBit & IMR0_1) && (ulBit & port1_in))) {              // rising edge
                IFR_1 |= ulBit;                                          // change detected
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_GPIO & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    if (ulBit & 0x000000ff) {
                        IRR_GPIO |= IR_GPIO_4;
                    }
                    else if (ulBit & 0x0000ff00) {
                        IRR_GPIO |= IR_GPIO_5;
                    }
                    else if (ulBit & 0x00ff0000) {
                        IRR_GPIO |= IR_GPIO_6;
                    }
                    else {
                        IRR_GPIO |= IR_GPIO_7;
                    }
                    interrupt_call();                                    // call GPIO change int handler
                }
            }
        }
#ifdef SUPPORT_ADC
        if ((ulBit & ACD_TRIGGER_INPUT) && ((PMR0_1 & ACD_TRIGGER_INPUT) && (!(PMR1_1 & ACD_TRIGGER_INPUT))) && (ADC_MR & TRGEN) && (ADC_MR & TRGSEL_EXT)) { // if ADC trigger configured
            if (port1_in & ACD_TRIGGER_INPUT) {                          // rising edge causes trigger
                fnADC_trigger();
            }
        }
#endif
#if defined _AT32UC3C                                                    // {8}
        fnHandleUC3C_EIC(ucPort, ulBit, port1_in);
#elif defined _AT32UC3B && !defined CHIP_48_PIN                          // {1} AT32UC3B 64 pin version has INT6..7 on port B
            if ((EIC_CTRL & EXT_INT_6) && (EIC_6_A & ulBit)) {           // if external interrupt 6 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_6)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_6) && (!(EIC_6_A & port1_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_6;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_6)) && (EIC_6_A & port1_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_6;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if ((EIC_CTRL & EXT_INT_7) && (EIC_7_A & ulBit)) {           // if external interrupt 7 enabled and change on corresponding pin
                if (!(EIC_MODE & EXT_INT_7)) {                           // edge triggered
                    if ((EIC_EDGE & EXT_INT_7) && (!(EIC_7_A & port1_in))) { // rising edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_7;
                    }
                    else if ((!(EIC_EDGE & EXT_INT_7)) && (EIC_7_A & port1_in)) { // falling edge
                        IRR1 |= IR_EXTERNAL_INT_CONTROLLER_7;
                    }
                }
                else {                                                   // level sensitive
                }
            }
            if (EIC_IMR & IRR1) {                                        // interrupt not masted
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    interrupt_call();                                    // call external int handler
                }
            }
#endif
        break;
    case 2:                                                              // port 2
        if (ulBit & ODER_2) {
            break;                                                       // port is enabled as output
        }
        if (iChange & (TOGGLE_INPUT | TOGGLE_INPUT_NEG)) {               // if port is not enabled as output
            port2_in ^= ulBit;
            PVR_2 ^= ulBit;                                              // toggle the input state
        }
        else if (iChange == SET_INPUT) {                                 // {7}
            if (port2_in & ulBit) {
                break;                                                   // no change caused
            }
            port2_in |= ulBit;                                           // set the input high
            PVR_2 |= ulBit;
        }
        else  {
            if (!(port2_in & ulBit)) {
                break;                                                   // no change caused
            }
            port2_in &= ~ulBit;                                          // set the input low
            PVR_2 &= ~ulBit;
        }
        if (IER_2 & ulBit) {                                             // if change interrupt enabled
          //if (ulBit & (CTS_0 | CTS_1)) {
          //    fnModemChange(ulBit, ((porta_in & ulBit) == 0), 0);      // handle potential CTS changes
          //}
            if (((ulBit & IMR1_2) && (!(ulBit & port2_in))) ||           // falling edge
                ((!(ulBit & IMR1_2)) && (!((ulBit & IMR0_2)))) ||        // any edge
                ((ulBit & IMR0_2) && (ulBit & port2_in))) {              // rising edge
                IFR_2 |= ulBit;                                          // change detected
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_GPIO & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    if (ulBit & 0x000000ff) {
                        IRR_GPIO |= IR_GPIO_8;
                    }
                    else if (ulBit & 0x0000ff00) {
                        IRR_GPIO |= IR_GPIO_9;
                    }
                    else if (ulBit & 0x00ff0000) {
                        IRR_GPIO |= IR_GPIO_10;
                    }
                    else {
                        IRR_GPIO |= IR_GPIO_11;
                    }                     
                    interrupt_call();                                    // call GPIO change int handler
                }
            }
        }
#if defined _AT32UC3C                                                    // {8}
        fnHandleUC3C_EIC(ucPort, ulBit, port2_in);
#endif
        break;
    case 3:                                                              // port 3
        if (ulBit & ODER_3) {
            break;                                                       // port is enabled as output
        }
        if (iChange & (TOGGLE_INPUT | TOGGLE_INPUT_NEG)) {               // if port is not enabled as output
            port3_in ^= ulBit;
            PVR_3 ^= ulBit;                                              // toggle the input state
        }
        else if (iChange == SET_INPUT) {                                 // {7}
            if (port3_in & ulBit) {
                break;                                                   // no change caused
            }
            port3_in |= ulBit;                                           // set the input high
            PVR_3 |= ulBit;
        }
        else  {
            if (!(port3_in & ulBit)) {
                break;                                                   // no change caused
            }
            port3_in &= ~ulBit;                                          // set the input low
            PVR_3 &= ~ulBit;
        }
        if (IER_3 & ulBit) {                                             // if change interrupt enabled
          //if (ulBit & (CTS_0 | CTS_1)) {
          //    fnModemChange(ulBit, ((porta_in & ulBit) == 0), 0);      // handle potential CTS changes
          //}
            if (((ulBit & IMR1_3) && (!(ulBit & port3_in))) ||           // falling edge
                ((!(ulBit & IMR1_3)) && (!((ulBit & IMR0_3)))) ||        // any edge
                ((ulBit & IMR0_3) && (ulBit & port3_in))) {               // rising edge
                IFR_3 |= ulBit;                                          // change detected
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_GPIO & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    if (ulBit & 0x000000ff) {
                        IRR_GPIO |= IR_GPIO_12;
                    }
                    else if (ulBit & 0x0000ff00) {
                        IRR_GPIO |= IR_GPIO_13;
                    }
#ifdef _AT32UC3C
                    else if (ulBit & 0x00ff0000) {
                        IRR_GPIO |= IR_GPIO_14;
                    }
                    else if (ulBit & 0xff000000) {
                        IRR_GPIO |= IR_GPIO_15;
                    }
#endif
                    interrupt_call();                                    // call GPIO change int handler
                }
            }
        }
#if defined _AT32UC3C                                                    // {8}
        fnHandleUC3C_EIC(ucPort, ulBit, port3_in);
#endif
        break;
    }
    iFlagRefresh = PORT_CHANGE;                                          // ensure port display is updated
}

extern unsigned long fnGetPresentPortState(int portNr)
{
    unsigned long ulState = 0;

    switch (portNr-1) {
    case 0:
        ulState = (PVR_0);
        break;
    case 1:
        ulState = (PVR_1);
        break;
    case 2:  
        ulState = (PVR_2);
        break;
    case 3:
        ulState = (PVR_3);
        break;
    }
    return ulState;
}

extern unsigned long fnGetPresentPortDir(int portNr)
{
    switch (portNr-1) {
    case 0:
        return (ODER_0 & GPER_0);                                        // non outputs returned as zeros
    case 1:
        return (ODER_1 & GPER_1);                                        // non outputs returned as zeros
    case 2:
        return (ODER_2 & GPER_2);                                        // non outputs returned as zeros
    case 3:
        return (ODER_3 & GPER_3);                                        // non outputs returned as zeros
    default:
        return 0;
    }
}

extern unsigned long fnGetPresentPortPeriph(int portNr)
{
    switch (portNr-1) {
    case 0:
#ifdef _AT32UC3B
        return (~(GPER_0) | ulOscillator);                               // respecting oscillator pin overrides
#else
        return (~GPER_0 | (ADC_CHSR << 21));
#endif
    case 1:
#if defined _AT32UC3C
        return (~(GPER_1) | ulOscillator);                               // respecting oscillator pin overrides
#else
        return (~GPER_1);
#endif
    case 2:
#if defined _AT32UC3B || defined _AT32UC3C
        return (~GPER_2);
#else
        return (~(GPER_2) | ulOscillator);                               // respecting oscillator pin overrides
#endif
    case 3:
        return (~GPER_3);
    }
    return 0;
}

// Process simulated interrupts
//
extern unsigned long fnSimInts(char *argv[])
{
    static int iRTS_action = 0;
    unsigned long ulNewActions = 0;
    int *ptrCnt;
    iInts &= ~PSEUDO_INT;

