sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
    if ((iInts & CHANNEL_0_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART0];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_0_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
		        iInts &= ~CHANNEL_0_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx0((unsigned char)US_THR_0);
                ulNewActions |= SEND_COM_0;
                iRTS_action |= NEGATE_RTS_0;
		        US_CSR_0 |= (TXRDY);                                     // simulate Tx int 
                if ((US_MR_0 & 0x0000c000) == 0x00008000) {              // check whether we are in tx loop back mode
                    US_RHR_0 = US_THR_0;                                 // put tx byte in rx buffer
			        US_CSR_0 |= (RXRDY);                                 // and Rx due to loop
		        }
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART0 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    IRR_UART0 = IR_USART0;
                    interrupt_call();                                    // call UART 0 int handler
                }
#endif
            }
        }
	}

    if ((!(iInts & CHANNEL_0_SERIAL_INT)) || (iMasks & CHANNEL_0_SERIAL_INT)) { // not going to enter again this time so react to RTS changes
        if (NEGATE_RTS_0 & iRTS_action) {
            iRTS_action &= ~NEGATE_RTS_0;
			if (0) {                                                     // when RTS line configured accordingly
                fnConfigSimSCI(0, NEGATE_RTS_COM_0, 0);                  // negate control line (RS485 uses negative logic)
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
                port3_in |= PX03;
    #else
                port0_in |= PA03;
    #endif
				if (!(iMasks & CHANNEL_0_SERIAL_INT)) {                  // if transmission has terminated queue assertion
					iRTS_action |= ASSERT_RTS_0;
				}
			}
        }
        else if (ASSERT_RTS_0 & iRTS_action) {
            iRTS_action &= ~ASSERT_RTS_0;
            fnConfigSimSCI(0, ASSERT_RTS_COM_0, 0);                      // negate control line (RS485 uses negative logic)
    #if defined USART0_RTS_ON_3 && defined CHIP_144_PIN
            port3_in &= ~PX03;
    #else
            port0_in &= ~PA03;
    #endif
        }
    }
	if ((iInts & CHANNEL_1_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART1];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_1_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
		        iInts &= ~CHANNEL_1_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx1((unsigned char)US_THR_1);
                ulNewActions |= SEND_COM_1;
                iRTS_action |= NEGATE_RTS_1;
		        US_CSR_1 |= (TXRDY);                                     // simulate Tx int 
                if ((US_MR_1 & 0x0000c000) == 0x00008000) {              // check whether we are in tx loop back mode
                    US_RHR_1 = US_THR_1;                                 // put tx byte in rx buffer
			        US_CSR_1 |= (RXRDY);                                 // and Rx due to loop
		        }
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    IRR_UART1 = IR_USART1;
                    interrupt_call();                                    // call UART 1 int handler
                }
#endif
            }
        }
	}
    if ((!(iInts & CHANNEL_1_SERIAL_INT)) || (iMasks & CHANNEL_1_SERIAL_INT)) { // not going to enter again this time so react to RTS changes
        if (NEGATE_RTS_1 & iRTS_action) {
            iRTS_action &= ~NEGATE_RTS_1;
            fnConfigSimSCI(1, NEGATE_RTS_COM_1, 0);                      // negate control line (RS485 uses negative logic)
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
            port2_in |= PX07;
    #else
            port0_in |= PA08;
    #endif
            if (!(iMasks & CHANNEL_0_SERIAL_INT)) {                      // if transmission has terminated queue assertion
                iRTS_action |= ASSERT_RTS_1;
            }
        }
        else if (ASSERT_RTS_1 & iRTS_action) {
            iRTS_action &= ~ASSERT_RTS_1;
            fnConfigSimSCI(1, ASSERT_RTS_COM_1, 0);                      // negate control line (RS485 uses negative logic)
    #if defined USART1_RTS_ON_2 && defined CHIP_144_PIN
            port2_in &= ~PX07;
    #else
            port0_in &= ~PA08;
    #endif
        }
    }

	if ((iInts & CHANNEL_2_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART2];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_2_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
		        iInts &= ~CHANNEL_2_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx2((unsigned char)US_THR_2);
                ulNewActions |= SEND_COM_2;
                iRTS_action |= NEGATE_RTS_2;
		        US_CSR_2 |= (TXRDY);                                     // simulate Tx int 
                if ((US_MR_2 & 0x0000c000) == 0x00008000) {              // check whether we are in tx loop back mode
                    US_RHR_2 = US_THR_2;                                 // put tx byte in rx buffer
			        US_CSR_2 |= (RXRDY);                                 // and Rx due to loop
		        }
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART2 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    IRR_UART2 = IR_USART2;
                    interrupt_call();                                    // call UART 2 int handler
                }
#endif
            }
        }
	}
    if ((!(iInts & CHANNEL_2_SERIAL_INT)) || (iMasks & CHANNEL_2_SERIAL_INT)) { // not going to enter again this time so react to RTS changes
        if (NEGATE_RTS_2 & iRTS_action) {
            iRTS_action &= ~NEGATE_RTS_2;
            fnConfigSimSCI(2, NEGATE_RTS_COM_2, 0);                      // negate control line (RS485 uses negative logic)
    #ifndef _AT32UC3C
        #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
            port3_in |= PX13;
        #elif defined USART2_RTS_ON_1
            port1_in |= PB01;
        #else
            port0_in |= PA29;
        #endif
    #endif
            if (!(iMasks & CHANNEL_2_SERIAL_INT)) {                      // if transmission has terminated queue assertion
                iRTS_action |= ASSERT_RTS_2;
            }
        }
        else if (ASSERT_RTS_2 & iRTS_action) {
            iRTS_action &= ~ASSERT_RTS_2;
            fnConfigSimSCI(2, ASSERT_RTS_COM_2, 0);                      // negate control line (RS485 uses negative logic)
    #ifndef _AT32UC3C
        #if defined USART2_RTS_ON_3 && defined CHIP_144_PIN
            port3_in &= ~PX13;
        #elif defined USART2_RTS_ON_1
            port1_in &= ~PB01;
        #else
            port0_in &= ~PA29;
        #endif
    #endif
        }
    }

	if ((iInts & CHANNEL_3_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART3];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_3_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
		        iInts &= ~CHANNEL_3_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx3((unsigned char)US_THR_3);
                ulNewActions |= SEND_COM_3;
                iRTS_action |= NEGATE_RTS_3;
		        US_CSR_3 |= (TXRDY);                                     // simulate Tx int 
                if ((US_MR_3 & 0x0000c000) == 0x00008000) {              // check whether we are in tx loop back mode
                    US_RHR_3 = US_THR_3;                                 // put tx byte in rx buffer
			        US_CSR_3 |= (RXRDY);                                 // and Rx due to loop
		        }
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART3 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    IRR_UART3 = IR_USART3;
                    interrupt_call();                                    // call UART 3 int handler
                }
#endif
            }
        }
	}
    if ((!(iInts & CHANNEL_3_SERIAL_INT)) || (iMasks & CHANNEL_3_SERIAL_INT)) { // not going to enter again this time so react to RTS changes
        if (NEGATE_RTS_3 & iRTS_action) {
            iRTS_action &= ~NEGATE_RTS_3;
            fnConfigSimSCI(3, NEGATE_RTS_COM_3, 0);                      // negate control line (RS485 uses negative logic)
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
            port2_in |= PX15;
    #else
            port1_in |= PB00;
    #endif
            if (!(iMasks & CHANNEL_3_SERIAL_INT)) {                      // if transmission has terminated queue assertion
                iRTS_action |= ASSERT_RTS_3;
            }
        }
        else if (ASSERT_RTS_3 & iRTS_action) {
            iRTS_action &= ~ASSERT_RTS_3;
            fnConfigSimSCI(3, ASSERT_RTS_COM_3, 0);                      // negate control line (RS485 uses negative logic)
    #if defined USART3_RTS_ON_2 && defined CHIP_144_PIN
            port2_in &= ~PX15;
    #else
            port1_in &= ~PB00;
    #endif
        }
    }
#if NUMBER_SERIAL > 4
	if ((iInts & CHANNEL_4_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART4];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_4_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
		        iInts &= ~CHANNEL_4_SERIAL_INT;                          // interrupt has been handled
    #ifdef SERIAL_INTERFACE
	            fnLogTx4((unsigned char)US_THR_4);
                ulNewActions |= SEND_COM_4;
//              iRTS_action |= NEGATE_RTS_4;
		        US_CSR_4 |= (TXRDY);                                     // simulate Tx int 
                if ((US_MR_4 & 0x0000c000) == 0x00008000) {              // check whether we are in tx loop back mode
                    US_RHR_4 = US_THR_4;                                 // put tx byte in rx buffer
			        US_CSR_4 |= (RXRDY);                                 // and Rx due to loop
		        }
                if (!(ulAVR32_CPU.SR & GM)) {                            // global interrupt not masked
                    void (*interrupt_call)(void);
                    interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART4 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                    IRR_UART4 = IR_USART4;
                    interrupt_call();                                    // call UART 4 int handler
                }
    #endif
            }
        }
	}
#endif
    if ((ASSERT_RTS_0 | NEGATE_RTS_0 | ASSERT_RTS_1 | NEGATE_RTS_1 | ASSERT_RTS_2 | NEGATE_RTS_2 | ASSERT_RTS_3 | NEGATE_RTS_3) & iRTS_action) {
        iInts |= PSEUDO_INT;                                             // add a pseudo interrupt so we are called on the next tick
        iMasks |= PSEUDO_INT;                                            // never enter immediately due to a speudo-interrupt
    }


    if ((iInts & I2C_INT0) != 0) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C0];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT0;                                      // enough I2C interupts handled in this tick period
            }
            else {
#if defined I2C_INTERFACE
		        iInts &= ~I2C_INT0;
                if (TWI_IMR & (TWI_TXRDY | TWI_RXRDY | TWI_TXCOMP)) {
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR11 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR11 = IR_TWI;
                        interrupt_call();                                // call TWI int handler
                    }                                              
                }
#endif
            }
        }
    }
#ifdef USB_INTERFACE
    if (iInts & USB_INT) {
        int iEndpoint = 0;
        iInts &= ~USB_INT;
        while ((iEndpoint < NUMBER_OF_USB_ENDPOINTS) && (ulEndpointInt != 0)) {
            if (ulEndpointInt & (1 << iEndpoint)) {
                ulEndpointInt &= ~(1 << iEndpoint);
                fnCheckUSBOut(0, 0, iEndpoint);
            }
            iEndpoint++;
        }
    }
#endif
    return ulNewActions;
}

// Simulate timers at tick rate if required
//
extern int fnSimTimers(void)
{
#if defined SIMULATE_FPGA
    fnSimFPGAPeriod();
#endif

    if ((WDT_CTRL & WATCHDOG_ENABLE) != 0) {                             // if watchdog enabled
        static unsigned long ulWatchdogCount = 0;
#if defined _AT32UC3C                                                    // {14}
        if (WDT_CLR == (WATCHDOG_KEY_2 | WDT_CLR_WDTCLR)) 
#else
        if (WDT_CLR == 0) 
#endif
        {                                                                // watchdog retrigger has been performed
            WDT_CLR = 0x55aa;                                            // mark read
            ulWatchdogCount = 0;
        }
        else {
            unsigned long ulWatchdogTrigger = (1 << (((WDT_CTRL >> 8) & 0x1f) + 1));
            ulWatchdogCount += ((TICK_RESOLUTION/1000) * SLOW_CLOCK/1000); // add the slow clocks during this interval
            if (ulWatchdogCount >= ulWatchdogTrigger) {
                ulWatchdogCount = 0;
                return RESET_CARD_WATCHDOG;                              // signal watchdog reset
            }
        }
    }

    ulAVR32_CPU.COUNT += (unsigned long)(((float)MASTER_CLOCK*(float)(TICK_RESOLUTION/1000))/(float)1000); // count during tick interval
    if ((ulAVR32_CPU.COMPARE != 0) && (ulAVR32_CPU.COUNT >= ulAVR32_CPU.COMPARE)) {
        ulAVR32_CPU.COUNT = 0;
        if (!(ulAVR32_CPU.SR & GM)) {                                    // global interrupt not masked
            void (*interrupt_call)(void);
            interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR0 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
            IRR0 = IR_SYSBLOCK_COMPARE;
            interrupt_call();                                            // call the interrupt handler
        }
    }
#if !defined _AT32UC3C                                                   // {6}
    if ((PM_PBAMASK & PBAMASK_TC) && (TC_SR_0 & TIM_CLKSTA)) {           // if timer 0 is powered and running
        unsigned long ulTickCount;
        switch (TC_CMR_0 & 0x07) {
        case 0:
            ulTickCount = (((TICK_RESOLUTION / 1000) *32768)/1000);      // clock pulses in tick period (32kHz oscillator)
            break;
        case 1:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(2*1000)); // clock pulses in tick period
            break;
        case 2:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(8*1000)); // clock pulses in tick period
            break;
        case 3:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(32*1000)); // clock pulses in tick period
            break;
        case 4:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(128*1000)); // clock pulses in tick period
            break;
        default:                                                         // external clock
            ulTickCount = 0;
            break;
        }
                                                                         // we support only RC compare
                                                                         // we support only RC compare
        if ((TC_CV_0 + ulTickCount) >= TC_RC_0) {                        // TC match?
            if (TC_CMR_0 & CPCSTOP) {
                TC_SR_0 &= ~TIM_CLKSTA;                                  // stop timer
            }
            if ((TC_CMR_0 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) {         // toggle TIOA0 on match
    #ifdef TIMER_A0_PX
    #else
                ulTIOA ^= TIMER_TIOA0;
    #endif
            }
            if (TC_IER_0 & TIM_CPCS) {                                   // if interrupt enabled on RC match
                if (ADC_MR & TRGSEL_T0) {                                // if the timer is set up to control ADC triggering
                    if ((TC_CMR_0 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) { // toggle TIOA0 on match
                        if (ulTIOA & TIMER_TIOA0) {                      // positive edge on TIOA0
    #ifdef SUPPORT_ADC
                            fnADC_trigger();
    #endif
                        }
                    }
                    TC_CV_0 = 0;                                         // reset count
                }
                else {
                    TC_CV_0 = 0;                                         // reset count
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR14 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR14 = IR_TC0;
                        interrupt_call();                                // call timer interrupt handler
                    }
                }
            }
        }
        else {
            TC_CV_0 = (unsigned short)(TC_CV_0 + ulTickCount);
        }
    }

    if ((PM_PBAMASK & PBAMASK_TC) && (TC_SR_1 & TIM_CLKSTA)) {           // if timer 1 is powered and running
        unsigned long ulTickCount;
        switch (TC_CMR_1 & 0x07) {
        case 0:
            ulTickCount = (((TICK_RESOLUTION / 1000) *32768)/1000);      // clock pulses in tick period (32kHz oscillator)
            break;
        case 1:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(2*1000)); // clock pulses in tick period
            break;
        case 2:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(8*1000)); // clock pulses in tick period
            break;
        case 3:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(32*1000));// clock pulses in tick period
            break;
        case 4:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(128*1000)); // clock pulses in tick period
            break;
        default:                                                         // external clock
            ulTickCount = 0;
            break;
        }
                                                                         // we support only RC compare
        if ((TC_CV_1 + ulTickCount) >= TC_RC_1) {                        // TC match?
            if (TC_CMR_1 & CPCSTOP) {
                TC_SR_1 &= ~TIM_CLKSTA;                                  // stop timer
            }
            if ((TC_CMR_1 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) {         // toggle TIOA1 on match
    #ifdef TIMER_A1_PX
    #else
                ulTIOA ^= TIMER_TIOA1;
    #endif
            }
            if (TC_IER_1 & TIM_CPCS) {                                   // if interrupt enabled on RC match
                if (ADC_MR & TRGSEL_T1) {                                // if the timer is set up to control ADC triggering
                    if ((TC_CMR_1 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) { // toggle TIOA1 on match
                        if (ulTIOA & TIMER_TIOA1) {                      // positive edge on TIOA1
    #ifdef SUPPORT_ADC
                            fnADC_trigger();
    #endif
                        }
                    }
                    TC_CV_1 = 0;                                         // reset count
                }
                else {
                    TC_CV_1 = 0;                                         // reset count
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR14 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR14 = IR_TC1;
                        interrupt_call();                                // call timer interrupt handler
                    }
                }
            }
        }
        else {
            TC_CV_1 = (unsigned short)(TC_CV_1 + ulTickCount);
        }
    }

