sWahlinRhoades/uTaskerModified/Hardware/AVR32/AVR32Sim.c
    if ((PM_PBAMASK & PBAMASK_TC) && (TC_SR_2 & TIM_CLKSTA)) {           // if timer 2 is powered and running 
        unsigned long ulTickCount;
        switch (TC_CMR_2 & 0x07) {
        case 0:
            ulTickCount = (((TICK_RESOLUTION / 1000) *32768)/1000);       // {4} clock pulses in tick period (32kHz oscillator)
            break;
        case 1:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(2*1000)); // clock pulses in tick period
            break;
        case 2:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(8*1000)); // clock pulses in tick period
            break;
        case 3:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(32*1000));// clock pulses in tick period
            break;
        case 4:
            ulTickCount = (TICK_RESOLUTION / 1000)*(PBA_CLOCK/(128*1000)); // clock pulses in tick period
            break;
        default:                                                         // external clock
            ulTickCount = 0;
            break;
        }
                                                                         // we support only RC compare
        if ((TC_CV_2 + ulTickCount) >= TC_RC_2) {                        // TC match?
            if (TC_CMR_2 & CPCSTOP) {
                TC_SR_2 &= ~TIM_CLKSTA;                                  // stop timer
            }
            if ((TC_CMR_2 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) {         // toggle TIOA2 on match
    #ifdef TIMER_A1_PX
    #else
                ulTIOA ^= TIMER_TIOA2;
    #endif
            }
            if (TC_IER_2 & TIM_CPCS) {                                   // if interrupt enabled on RC match
                if (ADC_MR & TRGSEL_T2) {                                // if the timer is set up to control ADC triggering
                    if ((TC_CMR_2 & ACPC_RC_TOGGLE) == ACPC_RC_TOGGLE) { // toggle TIOA2 on match
                        if (ulTIOA & TIMER_TIOA2) {                      // positive edge on TIOA2
    #ifdef SUPPORT_ADC
                            fnADC_trigger();
    #endif
                        }
                    }
                    TC_CV_2 = 0;                                         // reset count
                }
                else {
                    TC_CV_2 = 0;                                         // reset count
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR14 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR14 = IR_TC2;
                        interrupt_call();                                // call timer interrupt handler
                    }
                }
            }
        }
        else {
            TC_CV_2 = (unsigned short)(TC_CV_2 + ulTickCount);
        }
    }

    if ((PM_PBAMASK & PBAMASK_RM_RTC_EIC) && (RTC_CTRL & RTC_CTRL_EN)) { // {11} RTC is powered up and enabled
        if (RTC_CTRL & RTC_CTRL_CLKEN) {                                 // clock enabled to RTC
            double llCount;
            double llOverflow = (RTC_TOP + 1);
            if (RTC_CTRL & RTC_CTRL_CLK32) {                             // 32kHz clock
                llCount = (unsigned long)(((float)32768 * (float)(TICK_RESOLUTION / 1000))/(float)1000);
            }
            else {                                                       // RC oscillator input (slow clock)
                llCount = (unsigned long)(((float)SLOW_CLOCK * (float)(TICK_RESOLUTION / 1000))/(float)1000);
            }
            llCount += RTC_VAL;
            if (llCount >= llOverflow) {
                llCount -= llOverflow;
                RTC_ISR = RTC_TOPI;
            }
            RTC_VAL = (unsigned long)llCount;
            if (RTC_ISR & RTC_TOPI) {                                    // overflow has occurred
                if (RTC_IMR & RTC_TOPI) {                                // interrupt not masked
                    if (!(ulAVR32_CPU.SR & GM)) {                        // global interrupt not masked
                        void (*interrupt_call)(void);
                        interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                        IRR1 |= IR_REAL_TIME_COUNTER;                    // flag that the interrupt source is active
                        interrupt_call();                                // call RTC interrupt handler
                    }
                }
            }
        }
    }
#endif
#ifdef SUPPORT_ADC
    if (ADC_CR & START) {                                                // software ADC conversion start
        ADC_CR = 0;
        fnADC_trigger();
    }
#endif
    return 0;
}

// Simulate the reception of serial data by inserting bytes into the input buffer and calling interrupts
//
extern void fnSimulateSerialIn(int iPort, unsigned char *ptrDebugIn, unsigned short usLen)
{
    #ifdef SERIAL_INTERFACE
    if (iPort == 0) {
        if (!(US_CSR_0 & _RX_ENABLED)) {
            return;                                                      // receiver not enabled so ignore input data
        }
        if (US_RTOR_0 != 0) {
            usIdleCounter0 = (unsigned short)US_RTOR_0;                  // retrigger the idle counter on character detection
        }
	    while (usLen--) {
            US_CSR_0 |= RXRDY;
		    US_RHR_0 = *ptrDebugIn++;
            if (!(US_IMR_0 & RXRDY)) {                                   // no RXRDY interrupt masked
/*                if (US_RCR_0 != 0) {                                   // DMA reception
                    *(unsigned long *)US_RPR_0 = US_RHR_0;
                    (US_RPR_0)++;
                    (US_RCR_0)--;
                    if (US_RCR_0 == 0) {                                 // last transfer
                        US_CSR_0 |= ENDRX;
                        if ((US_IMR_0 & ENDRX) == 0) {
                            continue;                                    // no interrupt enabled
                        }
                    }
                    else {
                        continue;
                    }
                }*/
            }
            if (!(ulAVR32_CPU.SR & GM)) {                                // global interrupt not masked
                void (*interrupt_call)(void);
                interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART0 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                IRR_UART0 = IR_USART0;
                interrupt_call();                                        // call UART 0 int handler
            }
	    }
    }
    else if (iPort == 1) {
        if (!(US_CSR_1 & _RX_ENABLED)) {
            return;                                                      // receiver not enabled so ignore input data
        }
        if (US_RTOR_1 != 0) {
            usIdleCounter1 = (unsigned short)US_RTOR_1;                  // retrigger the idle counter on character detection
        }
	    while (usLen--) {
            US_CSR_1 |= RXRDY;
		    US_RHR_1 = *ptrDebugIn++;
            if (!(US_IMR_1 & RXRDY)) {                                   // no RXRDY interrupt masked
/*                if (US_RCR_1 != 0) {                                   // DMA reception
                    *(unsigned long *)US_RPR_1 = US_RHR_1;
                    (US_RPR_1)++;
                    (US_RCR_1)--;
                    if (US_RCR_1 == 0) {                                 // last transfer
                        US_CSR_1 |= ENDRX;
                        if ((US_IMR_1 & ENDRX) == 0) {
                            continue;                                    // no interrupt enabled
                        }
                    }
                    else {
                        continue;
                    }
                }*/
            }
            if (!(ulAVR32_CPU.SR & GM)) {                                // global interrupt not masked
                void (*interrupt_call)(void);
                interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART1 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                IRR_UART1 = IR_USART1;
                interrupt_call();                                        // call UART 1 int handler
            }
	    }
    }
    else if (iPort == 2) {
        if (!(US_CSR_2 & _RX_ENABLED)) {
            return;                                                      // receiver not enabled so ignore input data
        }
        if (US_RTOR_2 != 0) {
            usIdleCounter2 = (unsigned short)US_RTOR_2;                  // retrigger the idle counter on character detection
        }
	    while (usLen--) {
            US_CSR_2 |= RXRDY;
		    US_RHR_2 = *ptrDebugIn++;
            if (!(US_IMR_2 & RXRDY)) {                                   // no RXRDY interrupt masked
/*                if (US_RCR_2 != 0) {                                   // DMA reception
                    *(unsigned long *)US_RPR_2 = US_RHR_2;
                    (US_RPR_2)++;
                    (US_RCR_2)--;
                    if (US_RCR_2 == 0) {                                 // last transfer
                        US_CSR_2 |= ENDRX;
                        if ((US_IMR_2 & ENDRX) == 0) {
                            continue;                                    // no interrupt enabled
                        }
                    }
                    else {
                        continue;
                    }
                }*/
            }
            if (!(ulAVR32_CPU.SR & GM)) {                                // global interrupt not masked
                void (*interrupt_call)(void);
                interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART2 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                IRR_UART2 = IR_USART2;
                interrupt_call();                                        // call UART 2 int handler
            }
	    }
    }
    else if (iPort == 3) {
        if (!(US_CSR_3 & _RX_ENABLED)) {
            return;                                                      // receiver not enabled so ignore input data
        }
        if (US_RTOR_3 != 0) {
            usIdleCounter3 = (unsigned short)US_RTOR_3;                  // retrigger the idle counter on character detection
        }
	    while (usLen--) {
            US_CSR_3 |= RXRDY;
		    US_RHR_3 = *ptrDebugIn++;
            if (!(US_IMR_3 & RXRDY)) {                                   // no RXRDY interrupt masked
/*                if (US_RCR_3 != 0) {                                   // DMA reception
                    *(unsigned long *)US_RPR_3 = US_RHR_3;
                    (US_RPR_3)++;
                    (US_RCR_3)--;
                    if (US_RCR_3 == 0) {                                 // last transfer
                        US_CSR_3 |= ENDRX;
                        if ((US_IMR_3 & ENDRX) == 0) {
                            continue;                                    // no interrupt enabled
                        }
                    }
                    else {
                        continue;
                    }
                }*/
            }
            if (!(ulAVR32_CPU.SR & GM)) {                                // global interrupt not masked
                void (*interrupt_call)(void);
                interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART3 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                IRR_UART3 = IR_USART3;
                interrupt_call();                                        // call UART 3 int handler
            }
	    }
    }
        #if NUMBER_SERIAL > 4
    else if (iPort == 4) {
        if (!(US_CSR_4 & _RX_ENABLED)) {
            return;                                                      // receiver not enabled so ignore input data
        }
        if (US_RTOR_4 != 0) {
            usIdleCounter4 = (unsigned short)US_RTOR_4;                  // retrigger the idle counter on character detection
        }
	    while (usLen--) {
            US_CSR_4 |= RXRDY;
		    US_RHR_4 = *ptrDebugIn++;
            if (!(US_IMR_4 & RXRDY)) {                                   // no RXRDY interrupt masked
/*                if (US_RCR_4 != 0) {                                   // DMA reception
                    *(unsigned long *)US_RPR_4 = US_RHR_4;
                    (US_RPR_4)++;
                    (US_RCR_4)--;
                    if (US_RCR_4 == 0) {                                 // last transfer
                        US_CSR_4 |= ENDRX;
                        if ((US_IMR_4 & ENDRX) == 0) {
                            continue;                                    // no interrupt enabled
                        }
                    }
                    else {
                        continue;
                    }
                }*/
            }
            if (!(ulAVR32_CPU.SR & GM)) {                                // global interrupt not masked
                void (*interrupt_call)(void);
                interrupt_call = (void *)AVR32_ExceptionRAM[(((IPR_UART4 & 0x3fff) | ulAVR32_CPU.EVBA) + sizeof(unsigned long))/sizeof(unsigned long)];
                IRR_UART4 = IR_USART4;
                interrupt_call();                                        // call UART 4 int handler
            }
	    }
    }
        #endif
    #endif
}

#if defined I2C_INTERFACE
extern void fnSimulateI2C(int iPort, unsigned char *ptrDebugIn, unsigned short usLen, int iRepeatedStart)
{
}
#endif

#if defined SUPPORT_RTC                                                  // {11}

// The AVR32 doesn't have battery backup for its RTC (real-time counter)
//
extern void fnInitInternalRTC(char *argv[])
{
}
#endif


#endif